[{"datum":"01.Mai","fromTime":"22h","title":"Symbiotikka","description":"Jordan, Zagroza, Núria, Gerrit X Techno \"Expand your horizon and have a look over the edge. Celebrate with us Respect, Freedom, Love and Music!\" Kinky Shows live, Bondage Show live, Playspace, Bodypainting, Pool and some special surprises... Be particular, creative, sexy, wicked, kinky, especially or crazy. But never boring!"},{"datum":"02.Mai","fromTime":"22h","title":"Human Colours","description":"Milk`N Coffee, Rene Oldenburg, Johnny wants Milk, Orpheuz Techno, Tech House „We bring Techno, Burlesque and Body Art every first Thursday at KitKatClub! (...) The universe is full of colors and sounds that vibrate together.“ Kinky Body Painting by Thaly White – LightgoesDark. Secret Burlesque Performance by Maria Mané. This time we have two selected dancers for you to enchant your senses. Attention, we are the original KitKat party this evening, left entrance! There is another external event in the upper area of the club."},{"datum":"03.Mai","fromTime":"22h","title":"GEGEN Touch invites KAOS London","description":"131bpm, Ancient Methods, Ayako Mori, Choronzon, Daniel Wang, Khloe, Law 334, Miss Italia, Ne/Re/A, Posture, Putas Vampiras, Rangelova, Ruiz Osc1, S.A. Tweeman, Sparkly Pony Techno, House „Skin on skin. Teeth rubbing against other teeth. Teeth biting fingernails. Fingernails that pierce the palms of hands. Your hands that close the eyelids of the person in front of you. The back of your thigh crosses over the front of the other leg and the sweat that bonds everything together. Which of your body parts would like to be touched? (…)“ 5 Dancefloors. Performances by Edegar Starke, Fluxxious, Jazbazmaz, Kyle Patrick, Valentin Tszin, Yotta_Baka &amp; Mad Kate. Fruit Buffet, Swimming Pool, Sidekicks/Sonar Harm Reduction Stand. Minimum age/Mindestalter: 21+. Full concept and more informations:<br><br>https://de.ra.co/events/1871604 Tactile, textured, tangible, sensual, palpable, smooth, soft, velvet, silky, slick, underwear, athletic, lycra, fetish, latex, leather, or just simply skin-on-skin. No casual wear!"},{"datum":"04.Mai","fromTime":"23h","title":"CarneBall Bizarre-KitKatClubnacht","description":"Clark Kent, Der Freak, Lisa de Lune, Marc Lange und Cabaret Sultana. Bereits ab 20 Uhr im Basement: Stolz und Demut. Ab ca. 1 Uhr: Disco Bizarre im 4. Raum, im Basement: ToLoose le Track, Soul Bait und D.J. himself. Special Guest: Samantha Bank. Salon Rouge (ab ca. 2 Uhr) im 5. Raum, im Basement: Shredder. Prisma Floor: Xtralarge DJ Set + quieroStar Show, Andeel und Cheesebeat. Sauna, Outdoorarea, Playspace, Candy-Shop, etcetera .... :-) Kinky, Fetish, Gothik, Lack &amp; Leder, Kostüme, Glitzer &amp; Glamour, elegante Abendgarderobe, Außergewöhnliches jeder Art. Bunte Outfits werden bevorzugt! KEINE normale Straßenkleidung. Jeans &amp; Sportschuhe sind verboten! Normale Unterhosen auch. Wir sind kein Swingerclub. Anfassen, ohne das Einverständnis des Gegenübers, oder beim Vorübergehen, führt zu Hausverbot. Lebenslänglich."},{"datum":"05.Mai","fromTime":"08h","title":"Nachspiel-Afterhour: Carpe Diem!","description":"Kenny, Daora, Sascha Lindner, Kevin Maan Techno, Electro \"The most famous Sunday Afterhour at KitKat Club. Sex-positive and queer-friendly Party - kinky style! Hot or freaky, nerdy or beardy: everyone is welcome! Follow the rhythm of electronic music and be feel happy the way you are.\" Huge chill out areas, Swimming pool. Dress to impress! No street wear - no Jeans &amp; no T-Shirts."},{"datum":"05.Mai","fromTime":"11h","title":"Breakfast Club + Classical Sundays<br>","description":"Vicious V. Classical Concert (from 2 pm) Liebe Leute: Already the 6th edition of our Breakfast Club. A Frühstück Kultur Klub at Salon Rouge (basement floor of KitKatClub). It’s a Sunday afterglow… after the party, after waking up or after church… A smooth landing to end your week. Offering optional petit déjeuner buffet. This Sunday 05/05 we host a special classical concert, from 2 pm! Vynil session with our beloved selector Vicious V., fortune teller, Bingo, games and more… EXCLUSIVE ENTRANCE THROUGH THE BACKYARD via Ohmstr 11, 10179 Berlin. Follow the red rabbit. Reduced price for early birds (between 11 am and 12). Come in a state of contenance :-). 11-18h. More informations:<br><br>https://www.facebook.com/events/1602092657235112"},{"datum":"05.Mai","fromTime":"22h","title":"Somnambul BLN","description":"Boho, De Feo, Ozzy Riot Techno, Electro TheSundayNightElectronicDanceExperience@KitKatClub! \"The techno event for all sleepwalkers, moonstruck and ravers of the night offers a fine selection of DJs, because Sunday night is for dancing! Everything else is as usual at the KitKat: anything might happen - everything is possible - and nothing is obligatory.\" Outdoor pool area open. No strict Dresscode … be yourself!"},{"description":""},{"datum":"06.Mai","fromTime":"19h","title":"Tango Rouge Sensual Monday with Bachata &amp; Kizomba","description":"DJ Francesco Cieschi, DJ Hach Entry from 18:45/Einlass ab 18 Uhr 45. 19:00 classes in Tango, Bachata &amp; Kizomba. Tango Introduction with Dilara Ogretmen, Close Embrace with Malachai Payne, Tango Technique and Musicality with Luciano Des &amp; Natasha Barbará. Bachata open level with (tba). Kizomba open level with (tba). No experience and no partner needed! 21:00 Party on 2 floors. Tango Show by Luciano &amp; Natasha.<br><br>Our venue, Berlin's legendary KitKatClub, is a sex positive space where everyone can (doesn't have to) explore and express their sexuality without judgement and shame. Needless to say: Consent is always key. No dress code on Monday - but you are very welcome to dress to impress!"},{"datum":"06.Mai","fromTime":"22h","title":"Electric Monday","description":"Haito, Ingo Rieber, Ricardo Rodriguez, Frankie Flowerz Techno, House \"Enjoy the Vibe &amp; Get Freaky!\" Come As You Are and do Dress n Express yourself, KitKat style - colourful, fancy, wild, different, kinky, smart - most of all be authentic."},{"datum":"07.Mai","fromTime":"19h","title":"Erotic Life Drawing","description":"Erotic Life Drawing (Aktzeichnen) in Salon Rouge Floor (Raum 5) in the Basement of KitKatClub, featuring Sex Workers models. Next session Tuesday 7th of May, from 7pm til 10pm or later! Bring your own materials. Separate entrance through the backyard via Ohmstrasse 11, doors 19:00-0:00. Follow the signs &amp; the red lanterns! Entrance fee by donations, recommended 10-20 Euro. More informations:<br><br>https://www.facebook.com/events/737311951816104 No dress code."},{"datum":"07.Mai","fromTime":"22h","title":"Illusion","description":"Larsun Hesh, Achilles Techno \"Step into an enchanting realm where the ordinary gives way to the extraordinary at Illusion. (...) Let go of inhibitions as you immerse yourself in the pulsing energy that fills the air.\" Kinky, playful, extravagant, latex, leather, mesh, costumes - be creative and brave. No streetwear!"},{"datum":"08.Mai","fromTime":"22h","title":"Symbiotikka - 7 Years B-Day","description":"Anna Tur, Ramiro Lopez, Jordan, A.n.i., Tocadisco, Lovra, Tommahawk, Techmo, Roman Soler, Patrick Scuro as Scuro Black Techno, Tech House \"Expand your horizon and have a look over the edge. Celebrate with us Respect, Freedom, Love and Music! 7 years of SYMBIOTIKKA in the KitKatClub. Of course this has to be celebrated with an amazing program, we open the entire club with 3 dance floors. Until 9am in the morning. Come and celebrate with us.“ Kinky Shows live, Bondage Show live, Playspace, Bodypainting, Pool and some special surprises... Be particular, creative, sexy, wicked, kinky, especially or crazy. But never boring!"},{"datum":"09.Mai","fromTime":"22h","title":"Psycho Tentacles","description":"Incravalle, Fran-Cee, Ari, Johnson Patrick Where Psy meets Techno Performance feat. Nothosaur Toys, Play Area, Photos. Welcomes: LGBTQ, Body positivity, Inked."},{"datum":"10.Mai","fromTime":"22h","title":"Fetish Guerilla Revolution 2024","description":"Autotune, Christopher Lawrenz, Andreas Barth, Faray, Carl Conrad, DJ Pandemonium &amp; Evilyn13, Bootie Mashup, Sekto, Rudi Rachmann, John Crow, Tom Brut, Deckert Techno, Rock, Hardcore, Elektronic, Metal „FetishGuerilla ist ein Event, welches seit 2006 existiert. Wir sind offizieller Partner des GermanFetishBall-Wochenendes und finden nur einmal jährlich im legendären KitKatClub Berlin statt.“ Performances: Charlyne 864 (Shibari for guests from 10pm - Dungeon near „4.Raum“), Jade Lee, Rala duReign, Syban, Lou &amp; Mandy. Kein separater Vorverkauf, nur im VIP Wochenend-Ticket für den German Fetish Ball ist der Eintritt bereits enthalten. Für alle anderen gibt es die Tickets an der Abendkasse. Dress to impress: latex, (faux)leather, metal, pvc, nylon chic, gothic, creative, cosplay, furry, BDSM, cyberpunk, kink, fetish, fantasy, punk, extreme, classic, mustard, apocalyptic, woolfetish, clubkids…and so much more. „Your outfit doesn't have to be expensive. But it has to be a creative, authentic and unique expression! Be the eye-candy you want to see! NO real existing military-uniforms are allowed to this party!“"},{"datum":"11.Mai","fromTime":"19h","title":"Tango Rouge at CarneBall Bizarre","description":"19:00 Entrance Buffet. 19:30 2 Classes in Argentine Tango: No experience and no partner needed – come alone, as a couple or bring some friends! Warm up &amp; Beginners with Luciano Des &amp; Thekla, Drama &amp; playful figures with Natasha Barbará  &amp; Katarina Dmitrieva. 21:00 Milonga &amp; Party. Shows and performances through the night - Live music by Camila Arriva &amp; Federico Aguirre. Entrance 19:00-21:00. The entry is valid for the whole Saturday night in all areas of KitKatClub. Playful, kinky, fetish, carnival, crazy, sexy, extremely elegant Tango. Casual dress = no entry!"},{"datum":"11.Mai","fromTime":"23h","title":"CarneBall Bizarre-KitKatClubnacht","description":"Nikos Incravalle, Elixier, Travis, Felix FX und Lokomotive. Disco Bizarre im 4. Raum, im Basement: Bella Festa, Pat und Shimanski. Salon Rouge (ab 2 Uhr), im 5. Raum, im Basement: DJ Till Noon. Prisma Floor: Distelfink, Andeel und sound_solid. Sauna, Outdoorarea, Playspace, Candy-Shop, etcetera .... :-) Kinky, Fetish, Gothik, Lack &amp; Leder, Kostüme, Glitzer &amp; Glamour, elegante Abendgarderobe, Außergewöhnliches jeder Art. Bunte Outfits werden bevorzugt! KEINE normale Straßenkleidung. Jeans &amp; Sportschuhe sind verboten! Normale Unterhosen auch. Wir sind kein Swingerclub. Anfassen, ohne das Einverständnis des Gegenübers, oder beim Vorübergehen, führt zu Hausverbot. Lebenslänglich."},{"datum":"12.Mai","fromTime":"08h","title":"Nachspiel-Afterhour: Carpe Diem!","description":"Marcel db, Waikiki Techno, Electro \"The most famous Sunday Afterhour at KitKat Club. Sex-positive and queer-friendly Party - kinky style! Hot or freaky, nerdy or beardy: everyone is welcome! Follow the rhythm of electronic music and be feel happy the way you are.\" Huge chill out areas, Swimming pool. Dress to impress! No street wear - no Jeans &amp; no T-Shirts."},{"datum":"12.Mai","fromTime":"22h","title":"Somnambul BLN","description":"Agent!, Psidn, Stomp Boxx b2b Alex Lentini Techno, Electro TheSundayNightElectronicDanceExperience@KitKatClub! \"The techno event for all sleepwalkers, moonstruck and ravers of the night offers a fine selection of DJs, because Sunday night is for dancing! Everything else is as usual at the KitKat: anything might happen - everything is possible - and nothing is obligatory.\" Outdoor pool area open. No strict Dresscode … be yourself!"},{"description":""},{"datum":"13.Mai","fromTime":"19h","title":"Tango Rouge Sensual Monday with Bachata &amp; Kizomba","description":"DJ Pedram Shahyar, DJ Hach Entry from 18:45/Einlass ab 18 Uhr 45. 19:00 classes in Tango, Bachata &amp; Kizomba. Tango Introduction with Vanessa, Close Embrace with Malachai Payne, Tango Technique and Musicality with Sebastian Bolivar ☆World Champion of Tango Pista 2022✩ &amp; Dilara Ogretmen. Bachata open level by Tanja &amp; Anne. Kizomba open level by Sara &amp; Pam. No experience and no partner needed! 21:00 Party on 2 floors.<br><br>Our venue, Berlin's legendary KitKatClub, is a sex positive space where everyone can (doesn't have to) explore and express their sexuality without judgement and shame. Needless to say: Consent is always key. No dress code on Monday - but you are very welcome to dress to impress!"},{"datum":"13.Mai","fromTime":"22h","title":"Electric Monday","description":"Bruno Otranto, Emina Helena, Frankie Flowerz, Ricardo Rodriguez Techno, House \"Enjoy the Vibe &amp; Get Freaky. Bring &amp; Share Love as Usual!\" Come As You Are and do Dress n Express yourself, KitKat style - colourful, fancy, wild, different, kinky, smart - most of all be authentic."},{"datum":"14.Mai","fromTime":"22h","title":"Illusion - b2b Night","description":"Ximena b2b Th3os, Nay Laa b2b Stine Amundsen Techno \"Step into an enchanting realm where the ordinary gives way to the extraordinary at Illusion. (...) Let go of inhibitions as you immerse yourself in the pulsing energy that fills the air.\" Kinky, playful, extravagant, latex, leather, mesh, costumes - be creative and brave. No streetwear!"},{"datum":"15.Mai","fromTime":"22h","title":"Symbiotikka","description":"elMefti, Grace Thompson, Melanchromie, Bonq Techno \"Expand your horizon and have a look over the edge. Celebrate with us Respect, Freedom, Love and Music!\" Kinky Shows live, Bondage Show live, Playspace, Bodypainting, Pool and some special surprises... Be particular, creative, sexy, wicked, kinky, especially or crazy. But never boring!"},{"datum":"17.Mai","fromTime":"22h","title":"Revolver Party","description":"Fer Fox, Yannick Weineck, Federico Maniscalco, Jaycap, Marcel db, Feel.Ma, Oliver Mohns, Tante Renate Revolver is the monthly gay party event in KitKatClub. Men only! Buy your tickets: <br><br>https://revolverparty.com/tickets Fetish clothing, jockstraps, mesh shirts, sporty outfits. The more creative, the better!"},{"datum":"18.Mai","fromTime":"19h","title":"Tango Rouge at CarneBall Bizarre","description":"19:00 Entrance Buffet. 19:30 Classes in Argentine Tango: No experience and no partner needed – come alone, as a couple or bring some friends! Warm up &amp; Beginners with  Pedram Shahyar &amp; Thekla. Drama &amp; playful figures with Julian Elizari Romeo. 21:00 Milonga &amp; Party. Shows and performances through the night. Live music by Asaf and Doron hosting Alexander and the Small Balkan Band, accompanied by Acrobatics. Entrance 19:00 - 21:00, strict dresscode! Classes start in time so please come early. The entry is valid for the whole Saturday night in all areas of KitKatClub. Playful, kinky, fetish, carnival, crazy, sexy, extremely elegant Tango. Casual dress = no entry!"},{"datum":"18.Mai","fromTime":"23h","title":"CarneBall Bizarre-KitKatClubnacht","description":"Wolle XDP, Monty, Johann de Beers und Fran-Cee. Slow Grind Bizarre: Snap Gap und Don Rogall. Disco Bizarre im 4. Raum, im Basement: Seiun, Rigopolar und Shimanski. Salon Rouge (ab 2 Uhr), im 5. Raum, im Basement: DJ Eloiss b2b Khmgnff. Prisma Floor: Waves of Pleasure, maniaclina und Cheesebeat. Sauna, Outdoorarea, Playspace, Candy-Shop, etcetera .... :-) Kinky, Fetish, Gothik, Lack &amp; Leder, Kostüme, Glitzer &amp; Glamour, elegante Abendgarderobe, Außergewöhnliches jeder Art. Bunte Outfits werden bevorzugt! KEINE normale Straßenkleidung. Jeans &amp; Sportschuhe sind verboten! Normale Unterhosen auch. Wir sind kein Swingerclub. Anfassen, ohne das Einverständnis des Gegenübers, oder beim Vorübergehen, führt zu Hausverbot. Lebenslänglich."},{"datum":"19.Mai","fromTime":"08h","title":"Nachspiel-Afterhour: Carpe Diem!","description":"Kenny, Till Krimsen, Mandy van Dorten, Onkel Tom Techno, Electro \"The most famous Sunday Afterhour at KitKat Club. Sex-positive and queer-friendly Party - kinky style! Hot or freaky, nerdy or beardy: everyone is welcome! Follow the rhythm of electronic music and be feel happy the way you are.\" Huge chill out areas, Swimming pool. Dress to impress! No street wear - no Jeans &amp; no T-Shirts."},{"datum":"19.Mai","fromTime":"20h","title":"Intimacy///Somnambul: Tango Techno Dance Festival Night","description":"Andata, Ankytrixx, Dj Jauche, Frank Sonic, Markus Volker, Meyer Landsky Dj Team Techno, House, Tango TechnoTangoDanceFestivalNight@KitKatClub. On Pentecost Sunday, May 19, the \"Somnambul BLN - intimacy Fusion\" will celebrate, love and dance without a strict dress code, but all the more freely: Techno - Tango - Bachata - Zouk - Kizomba - Neo. 8 pm: dance classes and Techno in the pool area. From 9 pm: party on 5 floors. Techno: Line up, see above. Tango: Shows by Horacio Godoy &amp; Maricel Giacomini (Buenos Aires) and Ornella Simonetto &amp; Leo di Coco (Buenos Aires). Dj: Djurdjina Sijakovic Maidanik (Belgrade). Extatic Warmup by: Sven Elze. Tango Beginners Class by: Team Tango Rouge. Advanced Class by: Ornella &amp; Leo. Masterclass by: Horacio Godoy &amp; Maricel. Bachata: Dj Hach. Zouk &amp; Modern Tango: Dj Mona Isabelle &amp; Jan Lachenmayer. Kizomba: Dj Fabinho (at Prisma Bar). Shows: all night long! Outdoor pool area and candy shop open. „Everything else is as usual at the KitKat: anything might happen - everything is possible - and nothing is obligatory.“ No strict dress code ... Tango/Elegant/Kinky/Sexy/no classic street wear!"},{"description":""},{"datum":"20.Mai","fromTime":"19h","title":"Tango Rouge Sensual Monday with Bachata &amp; Kizomba","description":"DJ Ornella Simonetto, DJ Hach Entry from 18:45/Einlass ab 18 Uhr 45. 19:00 classes in Tango, Bachata &amp; Kizomba. Tango Introduction with Vanessa, Close Embrace with Dilara Ogretmen, Tango Technique and Musicality with Leo Di Cocco. Bachata open level with (tba). Kizomba open level with (tba). No experience and no partner needed! 21:00 Party on 2 floors.<br><br>Our venue, Berlin's legendary KitKatClub, is a sex positive space where everyone can (doesn't have to) explore and express their sexuality without judgement and shame. Needless to say: Consent is always key. No dress code on Monday - but you are very welcome to dress to impress!"},{"datum":"20.Mai","fromTime":"22h","title":"Electric Monday","description":"Ele Luz, Pornbugs, Ricardo Rodriguez, Frankie Flowerz Techno, House \"Enjoy the Vibe &amp; Get Freaky!\" Come As You Are and do Dress n Express yourself, KitKat style - colourful, fancy, wild, different, kinky, smart - most of all be authentic."},{"datum":"21.Mai","fromTime":"22h","title":"Illusion","description":"Melissa Dust, Nici Nice Techno \"Step into an enchanting realm where the ordinary gives way to the extraordinary at Illusion. (...) Let go of inhibitions as you immerse yourself in the pulsing energy that fills the air.\" Kinky, playful, extravagant, latex, leather, mesh, costumes - be creative and brave. No streetwear!"},{"datum":"22.Mai","fromTime":"22h","title":"Symbiotikka","description":"Cara Elizabeth, Jordan, C'mon, Sebastian Ludvig Techno \"Expand your horizon and have a look over the edge. Celebrate with us Respect, Freedom, Love and Music!\" Kinky Shows live, Bondage Show live, Playspace, Bodypainting, Pool and some special surprises... Be particular, creative, sexy, wicked, kinky, especially or crazy. But never boring!"},{"datum":"23.Mai","fromTime":"22h","title":"Seven Sins","description":"nkx, Tikoa Techno, Tech House „Seven Sins isn't just a party—it's a movement celebrating a sex-positive and consent-focused culture. Our mission is to create an inclusive atmosphere where all are welcome to explore and express their desires freely and safely. (…) Join us every 4th Thursday of the month at 22:00.“ LEFT ENTRANCE! More informations:<br><br>https://de.ra.co/events/1915848"},{"datum":"24.Mai","fromTime":"22h","title":"The Mystic Rose meets GIRL- + LADYPOWER","description":"Chincilla, Z-Cat, Joanna, Sake, Dee Luna, Mulle Downtempo, Psytrance 3 floors. Visuals &amp; Arts: Caos Conzept, Bodypainting by LightgoesDark, Hypnotikal Laser Productions. Spacebar by Ganesh, Massagen von Philipp. No Dresscode... Just be yourself... But be sexy..."},{"datum":"25.Mai","fromTime":"19h","title":"Tango Rouge at CarneBall Bizarre","description":"19:00 Entrance Buffet. 19:30 Classes in Argentine Tango: No experience and no partner needed – come alone, as a couple or bring some friends! Warm up &amp; Beginners with  Pedram Shahyar &amp; Thekla. Drama &amp; playful figures with Julian Elizari Romeo. 21:00 Milonga &amp; Party. Shows and performances through the night. Live music by Damian Dalessandro, Lea Hart and Laico Ruiz Dominguez. Entrance 19:00 - 21:00, strict dresscode! Classes start in time so please come early. The entry is valid for the whole Saturday night in all areas of KitKatClub. Playful, kinky, fetish, carnival, crazy, sexy, extremely elegant Tango. Casual dress = no entry!"},{"datum":"25.Mai","fromTime":"23h","title":"CarneBall Bizarre-KitKatClubnacht","description":"Flash, Chaos Techno Berlin, Don Tom, Felix FX, JP Lantieri und Puk. Disco Bizarre im 4. Raum, im Basement: Telexketch, Flaavio und Billy Idle. Salon Rouge (ab 2 Uhr), im 5. Raum, im Basement: Dj Khan of Finland. Prisma Floor: sound_solid, Andeel und The Shredder. Sauna, Outdoorarea, Playspace, Candy-Shop, etcetera .... :-) Kinky, Fetish, Gothik, Lack &amp; Leder, Kostüme, Glitzer &amp; Glamour, elegante Abendgarderobe, Außergewöhnliches jeder Art. Bunte Outfits werden bevorzugt! KEINE normale Straßenkleidung. Jeans &amp; Sportschuhe sind verboten! Normale Unterhosen auch. Wir sind kein Swingerclub. Anfassen, ohne das Einverständnis des Gegenübers, oder beim Vorübergehen, führt zu Hausverbot. Lebenslänglich."},{"datum":"26.Mai","fromTime":"08h","title":"Nachspiel-Afterhour: Carpe Diem!","description":"Stempelmann, Chris Veron Techno, Electro \"The most famous Sunday Afterhour at KitKat Club. Sex-positive and queer-friendly Party Edition - kinky style! Hot or freaky, nerdy or beardy: everyone is welcome! Follow the rhythm of electronic music and be feel happy the way you are.\" Huge chill out areas, Swimming pool. Dress to impress! No street wear - no Jeans &amp; no T-Shirts."},{"datum":"26.Mai","fromTime":"22h","title":"Somnambul BLN","description":"Diego Straube, Favio Inker, Lina Techno, Electro TheSundayNightElectronicDanceExperience@KitKatClub! \"On Sunday from 10 p.m., the Somnambul BLN celebrates, loves and dances without a strict dress code, but all the more freely. (...) Everything else is as usual at the KitKat: anything might happen - everything is possible - and nothing is obligatory.\" Outdoor pool area is open. No strict Dresscode … be yourself!"},{"description":""},{"datum":"27.Mai","fromTime":"19h","title":"Tango Rouge Sensual Monday with Bachata &amp; Kizomba","description":"DJ Francesco Cieschi, DJ Hach Entry from 18:45/Einlass ab 18 Uhr 45. 19:00 classes in Tango, Bachata &amp; Kizomba. Tango Introduction with Anne Blick, Close Embrace with Mimi Hirsch, Tango Technique and Musicality with Juampy Ramirez. Bachata open level with Leonie &amp; Miki. Kizomba open level with (tba). No experience and no partner needed! 21:00 Party on 2 floors. 11 pm Show by Juampy Ramirez &amp; Leandro Furlan. Don't miss this!<br><br>Our venue, Berlin's legendary KitKatClub, is a sex positive space where everyone can (doesn't have to) explore and express their sexuality without judgement and shame. Needless to say: Consent is always key. No dress code on Monday - but you are very welcome to dress to impress!"},{"datum":"27.Mai","fromTime":"22h","title":"Electric Monday","description":"Norman Weber, Anouch AK, Frankie Flowerz, Ricardo Rodriguez Techno, House \"Enjoy the Vibe &amp; Get Freaky. Bring &amp; Share Love as Usual!\" Come As You Are and do Dress n Express yourself, KitKat style - colourful, fancy, wild, different, kinky, smart - most of all be authentic."},{"datum":"28.Mai","fromTime":"19h","title":"Metamorphic Sculptures – Finissage &amp; Bday party","description":"Zandøly (DJ &amp; Producer, from 10:30 pm) CêCê (Singer &amp; Songwriter, from 9:30 pm) „An exciting evening celebrating the closing of Dan Carabas’ METAMORPHIC SCULPTURES exhibition and his birthday party!! (…) Location: Salon Rouge at KitKatClub Berlin. IMPORTANT: Entrance through the backyard via Ohmstrasse 11!! Not at the main door! This is a free event, donations are welcome at the bar!“ More informations:<br><br>https://www.facebook.com/events/857083369771202"},{"datum":"28.Mai","fromTime":"22h","title":"Illusion","description":"Jakob Lesch, Destro Techno \"Step into an enchanting realm where the ordinary gives way to the extraordinary at Illusion. (...) Let go of inhibitions as you immerse yourself in the pulsing energy that fills the air.\" Kinky, playful, extravagant, latex, leather, mesh, costumes - be creative and brave. No streetwear!"},{"datum":"29.Mai","fromTime":"22h","title":"Symbiotikka","description":"Teenage Mutants, Jordan, Dennis Rema, Rachel Raw, Millie Forsberg Techno \"Expand your horizon and have a look over the edge. Celebrate with us Respect, Freedom, Love and Music!\" Kinky Shows live, Bondage Show live, Playspace, Bodypainting, Pool and some special surprises... Be particular, creative, sexy, wicked, kinky, especially or crazy. But never boring!"},{"datum":"30.Mai","fromTime":"22h","title":"Reflective Sounds goes KitKat feat. Harriet Jaxxon","description":"Harriet Jaxxon, Dirty Plates, Skulder &amp; Mully, Yoru, Zoé, hosted by MC Do Different colors of Drum &amp; Bass Art exhibition by Illujean &amp; Phasebound, bodypainting with Klee, Polaroids by Marie Jay. New opening hours: 22:00 – 06:00. More informations and different presale tickets that will be prioritized at the door:<br><br>https://de.ra.co/events/1897882"},{"datum":"31.Mai","fromTime":"22h","title":"PiepShow","description":"Tim Hagemann, Enjoyvoid, Techno Thomson, Núria, Juan Del Chambo, Lale Hepborn, Schiela, Ken. Prisma: Paderkid, Jupiter Gatling. Salon Rouge: Solatic, Camerøn, Disaster Techno, Hard Techno, Hard Trance, House, Disco, Pop &amp; Mashup 5 dancefloors, basement area open! Many play-areas &amp; darkrooms throughout the entire club. Shibari-Show by Merlin, Drag Show by CoCo Kitsch and Raven van Krüger. Candy-Shop, Veggie buffet by Stefano. Shop/Accessoires by Lisa Majun. Sidekicks Berlin (former ManCheck). \"We can't wait to rave with YOU!\" &lt;3 Kinky or fetish (black or colourful), sporty (sportswear + sneakers), creative (sexy + imaginative), costumes. Regular jeans or T-shirts are usually no piep-outfits."},{"description":""},{"datum":"01.Jun","fromTime":"23h","title":"CarneBall Bizarre-KitKatClubnacht","description":"(tba). Bereits ab 20 Uhr im Basement: Stolz und Demut. Ab ca. 1 Uhr: Disco Bizarre im 4. Raum, im Basement: My Secret Playground, Florian Loveshack und D.J. himself. Salon Rouge (ab ca. 2 Uhr), im 5. Raum, im Basement: (tba). Prisma Floor: (tba). Sauna, Outdoorarea, Playspace, Candy-Shop, etcetera .... :-) Kinky, Fetish, Gothik, Lack &amp; Leder, Kostüme, Glitzer &amp; Glamour, elegante Abendgarderobe, Außergewöhnliches jeder Art. Bunte Outfits werden bevorzugt! KEINE normale Straßenkleidung. Jeans &amp; Sportschuhe sind verboten! Normale Unterhosen auch. Wir sind kein Swingerclub. Anfassen, ohne das Einverständnis des Gegenübers, oder beim Vorübergehen, führt zu Hausverbot. Lebenslänglich."},{"datum":"02.Jun","fromTime":"08h","title":"Nachspiel-Afterhour: Carpe Diem!","description":"Match Hoffman, Daora Techno, Electro \"The most famous Sunday Afterhour at KitKatClub. Sex-positive and queer-friendly Party Edition - kinky style! Hot or freaky, nerdy or beardy: everyone is welcome! Follow the rhythm of electronic music and be feel happy the way you are.\" Huge chill out areas, Swimming pool. Dress to impress! No street wear - no Jeans &amp; no T-Shirts."},{"datum":"02.Jun","fromTime":"22h","title":"Somnambul BLN","description":"Max Muth, Mila Dietrich, Tom Cordes Techno, Electro TheSundayNightElectronicDanceExperience@KitKatClub! \"On Sunday from 10 p.m., the Somnambul BLN celebrates, loves and dances without a strict dress code, but all the more freely. (...) Everything else is as usual at the KitKat: anything might happen - everything is possible - and nothing is obligatory.\" Outdoor pool area is open. No strict Dresscode … be yourself!"},{"description":""},{"datum":"03.Jun","fromTime":"19h","title":"Tango Rouge","description":"(tba) 3 Tango classes (beginners, intermediate, advanced) from 7 pm. You don't need a partner for the classes - you can come alone, as a couple or in a group. Tango Party from 9 pm. Entry from 6:45 pm/Einlass ab 18 Uhr 45.<br><br>Our venue, Berlin's legendary KitKatClub, is a sex positive space where everyone can (doesn't have to) explore and express their sexuality without judgement and shame. Needless to say: Consent is always key. No dress code on Monday - but you are very welcome to dress to impress!"},{"datum":"03.Jun","fromTime":"22h","title":"Electric Monday","description":"Annina &amp; Scoopsi, Andre Lodemann, Berkita, Frankie Flowerz, Ricardo Rodriguez Techno, House \"Enjoy the Vibe &amp; Get Freaky. Bring &amp; Share Love as Usual!\" Come As You Are and do Dress n Express yourself, KitKat style - colourful, fancy, wild, different, kinky, smart - most of all be authentic."},{"datum":"04.Jun","fromTime":"22h","title":"Illusion","description":"(tba) Techno \"Step into an enchanting realm where the ordinary gives way to the extraordinary at Illusion. (...) Let go of inhibitions as you immerse yourself in the pulsing energy that fills the air.\" Kinky, playful, extravagant, latex, leather, mesh, costumes - be creative and brave. No streetwear!"},{"datum":"05.Jun","fromTime":"22h","title":"Symbiotikka","description":"Jose Bonetto, Jordan, Vom Feisten, Zagroza Techno \"Expand your horizon and have a look over the edge. Celebrate with us Respect, Freedom, Love and Music!\" Kinky Shows live, Bondage Show live, Playspace, Bodypainting, Pool and some special surprises... Be particular, creative, sexy, wicked, kinky, especially or crazy. But never boring!"},{"datum":"06.Jun","fromTime":"22h","title":"Human Colours X Hexenwerk Festival","description":"Je Saré, Macho Milano, Der Eggert, Modulatos, Christoph Kuhlmann, Somaphon, Milk`N Coffee, Schnabeln &amp; Saugen Techno, Tech House „We bring Techno, Burlesque and Body Art every first Thursday at KitKatClub! (...) The universe is full of colors and sounds that vibrate together.“ Kinky Body Painting by Thaly White – LightgoesDark. Secret Burlesque Performance by Maria Mané. Attention, we are the original KitKat party this evening, LEFT ENTRANCE! There is another external event in the upper area of the club. More informations and pre-sale tickets:<br><br>https://de.ra.co/events/1821597"},{"datum":"07.Jun","fromTime":"22h","title":"Four Play 8th Anniversary","description":"Any Mello, Camea, Hang Aoki, Jon Hester, Lina, N.E.O., Niemand &amp; Keiner, Wanda Wild, Mømentum, Mi-Ka, Phillip Gorbachev, 5 String Theory, The Naked Tea Party Techno, House „8 YEARS FOUR PLAY! 8 years of making our scene lighter, more colorful, and happier. (…) 8 years, and we have only just started!“ 5 Floors, Basement area open. Performer Program: artEmiss Collective, Burlesque Show by Eros, Dream Circus Pirates, Dream Worlds: Scissortopia, Evilyn Frantic, Maia Friend. Stations and Activities: Erotic Tarot Reading, Kinky Booth, Pokemon Center Massage Clinic, Sexify Happenings, Sketch Artists, The Naked Tea Party. The CODE Kindergarten: Frau Dark, The Naughty Ballosint, The Naughty Clown, The Naughty Educator, The Naughty Nanny. Kinky Market Place by GammaWear, IMPOPSIBILE, Shimmies. More informations:<br><br>https://de.ra.co/events/1832696 Sexy swimsuits, costumes, leather, latex, naked, super heroes, lingerie, colorful festival style. No casual street wear such as jeans is allowed!"},{"datum":"08.Jun","fromTime":"19h","title":"Tango Rouge at CarneBall Bizarre","description":"19:00 Entrance Buffet. 19:30 Classes in Argentine Tango: No experience and no partner needed – come alone, as a couple or bring some friends! 2 Classes, Beginners Class: Introduction to Tango. Dramatic &amp; playful figures. 21:00 Tango Party in Salon Rouge. Live music and Performances all night long. Entry from 19:00/Einlass ab 19:00 Uhr, you need to be there before 21:00. The entry is valid for the whole Saturday night in all areas of KitKatClub. Playful, kinky, fetish, carnival, crazy, sexy, extremely elegant Tango. Casual dress = no entry!"},{"datum":"08.Jun","fromTime":"23h","title":"CarneBall Bizarre-KitKatClubnacht","description":"(tba). Disco Bizarre im 4. Raum, im Basement: Chris Gavin, Early Grey und Billy Idle. Salon Rouge (ab 2 Uhr), im 5. Raum, im Basement: (tba). Prisma Floor: (tba). Sauna, Outdoorarea, Playspace, Candy-Shop, etcetera .... :-) Kinky, Fetish, Gothik, Lack &amp; Leder, Kostüme, Glitzer &amp; Glamour, elegante Abendgarderobe, Außergewöhnliches jeder Art. Bunte Outfits werden bevorzugt! KEINE normale Straßenkleidung. Jeans &amp; Sportschuhe sind verboten! Normale Unterhosen auch. Wir sind kein Swingerclub. Anfassen, ohne das Einverständnis des Gegenübers, oder beim Vorübergehen, führt zu Hausverbot. Lebenslänglich."},{"datum":"09.Jun","fromTime":"08h","title":"Nachspiel - BDay-Special","description":"Marcel db, DJ Funk@delic, Gizmo Techno, Electro \"The most famous Sunday Afterhour at KitKat Club. Sex-positive and queer-friendly Party Edition - kinky style! Hot or freaky, nerdy or beardy: everyone is welcome! Follow the rhythm of electronic music and be feel happy the way you are.\" Huge chill out areas, Swimming pool. Dress to impress! No street wear - no Jeans &amp; no T-Shirts."},{"datum":"09.Jun","fromTime":"14h","title":"Classical Sundays: Salon Rouge @ KitKatClub","description":"Classical Concert (from 14.00) Classical sundays gets kinky in the Salon Rouge of KitKatClub. BACK ENTRANCE at Ohmstraße 11. Last time at KitKat until the fall :-). Brunch starts at 11.00, <br>Concert at 14.00. Tickets at the door -- sliding scale from 5€, extra donation for food. Comfy. :-)"},{"datum":"09.Jun","fromTime":"22h","title":"Somnambul BLN","description":"Gallya, Spicy Flamingo, Vlad Yaki Techno, Electro TheSundayNightElectronicDanceExperience@KitKatClub! \"On Sunday from 10 p.m., the Somnambul BLN celebrates, loves and dances without a strict dress code, but all the more freely. (...) Everything else is as usual at the KitKat: anything might happen - everything is possible - and nothing is obligatory.\" Outdoor pool area is open. No strict Dresscode … be yourself!"},{"description":""},{"datum":"10.Jun","fromTime":"19h","title":"Tango Rouge","description":"(tba) 3 Tango classes (beginners, intermediate, advanced) from 7 pm. You don't need a partner for the classes - you can come alone, as a couple or in a group. Tango Party from 9 pm. Entry from 6:45 pm/Einlass ab 18 Uhr 45.<br><br>Our venue, Berlin's legendary KitKatClub, is a sex positive space where everyone can (doesn't have to) explore and express their sexuality without judgement and shame. Needless to say: Consent is always key. No dress code on Monday - but you are very welcome to dress to impress!"},{"datum":"10.Jun","fromTime":"22h","title":"Electric Monday","description":"Justin Massei, Hi Hat Dancer, Soltight, Ricardo Rodriguez, Frankie Flowerz Techno, House \"Enjoy the Vibe &amp; Get Freaky. Bring &amp; Share Love as Usual!\" Come As You Are and do Dress n Express yourself, KitKat style - colourful, fancy, wild, different, kinky, smart - most of all be authentic."},{"datum":"11.Jun","fromTime":"19h","title":"Erotic Life Drawing","description":"Erotic Life Drawing (Aktzeichnen) in Salon Rouge Floor (Raum 5) in the Basement of KitKatClub, featuring Sex Workers models. Next session Tuesday 11th of June, from 7pm til 10pm or later! Bring your own materials. Separate entrance through the backyard via Ohmstrasse 11, doors 19:00-0:00. Follow the signs &amp; the red lanterns! Entrance fee by donations, recommended 10-20 Euro. No dress code."},{"datum":"11.Jun","fromTime":"22h","title":"Illusion","description":"(tba) Techno \"Step into an enchanting realm where the ordinary gives way to the extraordinary at Illusion. (...) Let go of inhibitions as you immerse yourself in the pulsing energy that fills the air.\" Kinky, playful, extravagant, latex, leather, mesh, costumes - be creative and brave. No streetwear!"},{"datum":"12.Jun","fromTime":"22h","title":"Symbiotikka – Chris B-Day Special","description":"Mija, Lovra, Jordan, Anubix Techno \"Expand your horizon and have a look over the edge. Celebrate with us Respect, Freedom, Love and Music!\" Kinky Shows live, Bondage Show live, Playspace, Bodypainting, Pool and some special surprises... Be particular, creative, sexy, wicked, kinky, especially or crazy. But never boring!"},{"datum":"13.Jun","fromTime":"22h","title":"Psycho Benecke","description":"Mark Benecke, Coon, Ari, Match Hoffman, Johnson Patrick Techno, Psytrance \"Where Psy meets Techno. In the basement of KitKatClub.“ Performance, Play Area, Photos. Welcomes: LGBTQ, Body positivity, Inked. Pre-sale tickets:<br><br>https://de.ra.co/events/1931167"},{"datum":"14.Jun","fromTime":"22h","title":"Revolver Party","description":"Moussa, Hendrik Milan, Federico Maniscalco, Tiefton, Oliver M, Jaycap, 2Faro, Kitty Vader Revolver is the monthly gay party event in KitKatClub. “Our events are safe spaces for queer and trans men and are THEREFORE strictly men only!“ Buy your tickets: <br><br>https://revolverparty.com/tickets Fetish clothing, jockstraps, mesh shirts, sporty outfits. The more creative, the better!"},{"datum":"15.Jun","fromTime":"19h","title":"Tango Rouge at CarneBall Bizarre","description":"19:00 Entrance Buffet. 19:30 Classes in Argentine Tango: No experience and no partner needed – come alone, as a couple or bring some friends! 2 Classes, Beginners Class: Introduction to Tango. Dramatic &amp; playful figures. 21:00 Tango Party in Salon Rouge. Live music and Performances all night long. Entry from 19:00/Einlass ab 19:00 Uhr, you need to be there before 21:00. The entry is valid for the whole Saturday night in all areas of KitKatClub. Playful, kinky, fetish, carnival, crazy, sexy, extremely elegant Tango. Casual dress = no entry!"},{"datum":"15.Jun","fromTime":"23h","title":"CarneBall Bizarre-KitKatClubnacht","description":"(tba). Disco Bizarre im 4. Raum, im Basement: Giacomo Virzi, (tba) und Billy Idle. Salon Rouge (ab 2 Uhr), im 5. Raum, im Basement: (tba). Prisma Floor: (tba). Sauna, Outdoorarea, Playspace, Candy-Shop, etcetera .... :-) Kinky, Fetish, Gothik, Lack &amp; Leder, Kostüme, Glitzer &amp; Glamour, elegante Abendgarderobe, Außergewöhnliches jeder Art. Bunte Outfits werden bevorzugt! KEINE normale Straßenkleidung. Jeans &amp; Sportschuhe sind verboten! Normale Unterhosen auch. Wir sind kein Swingerclub. Anfassen, ohne das Einverständnis des Gegenübers, oder beim Vorübergehen, führt zu Hausverbot. Lebenslänglich."}]