[
    {
        "title": "International Sex Affairs",
        "fromTime": "20:00",
        "description": "Dresscode: Sexy und stilvoll - Eure Fantasie ist Euer einziger Kompass! Swinger Party & Fuckable Beats All inclusive* Getränke  Early Bird bis 21:00 Discount 10€ auf den Eintrittpreis für Paare & Frauen!<hr>Das Wunderbare am Dienstagabend sind die internationalen Begegnungen: fern der Heimat mitsamt ihrer Prüderie, der oftmals fehlenden heimischen Swingerclubkultur und des potenziellen Erwischt – Werdens durch unliebsame Nachbarn, reisen immer mehr abenteuerlustige Swinger aus aller Welt nach Berlin, um sich in der internationalen Sprache der Wollust zu verständigen und ihren sexuellen Horizont zu erweitern.  Während einer Geschäftsreise lässt sich immer mal eine „wichtige Besprechung“ abseits des offiziellen Programms machen, und so suchen sexhungrige Swingerpaare und Singles gerade unter der Woche ihren Spaß in der anonymen Großstadt.  Genieße einen versexten Abend mit spielfreudigen Nymphomaninnen, abenteuerlustigen Paaren und standhaften Herren in der lasziven Atmosphäre des INSOMNIA.  Open Bar, Whirlpool & Fuckable Beats  Wenn kubanischer Rhythmus mit israelischer Lebensfreude vögelt, sich norwegische Wikinger und australische Naturschönheiten vereinigen, asiatische Frühlingsrollen in italienische Calzone stoßen, die russische Zarin vom amerikanischen Deckhengst zugeritten wird und „mittenmang“ die erotische Berliner Szene kräftig mitmischt – dann haben wir International Sex Affairs - die erotische Globalisierung im Insomnia.  Bei uns herrscht Aktiver Konsens, d.h. erst fragen, dann anfassen. Wer swingen will, sollte freundlich und offen auf andere zugehen, ohne dabei penetrant zu sein. Wer SM Spielchen machen will, muss den richtigen Ton finden! Ein “Nein” ist ein “Nein” und wird auch nicht diskutiert!  Dies ist eine Sexparty und wir wünschen uns aktive Teilnehmer die sich in einvernehmlichen Situationen begegnen.  Wer sich erst einmal umsehen möchte, erste vorsichtige Schritte wagen will, empfehlen wir Freitag/Samstag mit erotischen Tanz - und Mottoparties.  *außer Champagner & Cocktails",
        "externalId": "3810",
        "externalPicture": "https://www.insomnia-berlin.de/galpics/galleries/eventflyer/medium/0000082801.jpg",
        "link": "https://www.insomnia-berlin.de/partys_party-detail.html?id=3810",
        "tags": [
            "Sexpositive",
            "Erotic",
            "Fetish",
            "Burlesque",
            "Swinger",
            "BDSM"
        ],
        "fromDate": "04.06"
    },
    {
        "title": "Pinky Jazz -  A Journey from Jazz to House",
        "fromTime": "20:00",
        "description": "Sexpositive House & Jazz Bar und Club Mit jeder Veranstaltung tauchen wir in den Sound von unterschiedlichen Diven wie Sade, Amy Winehouse, Erykah Badu und den Queens of Jazz ein. Komm zu uns und erlebe mit uns ein neues sexy Eleganz-Erlebnis Dresscode: Sexy - Kinky - Elegant - Fetisch<hr>Als Sil Romero, eine Musikerin, Produzentin, Komponistin und Sängerin, die sich auf Jazz und House-Musik spezialisiert hat, habe ich \"Pinky Jazz\" kreiert, eine ganz besondere Veranstaltung, die ich gerne in den Club Insomnia bringen möchte.   Dieses Event verbindet auf wunderbare Weise die raffinierten Klänge des Jazz mit den lebhaften Rhythmen der House-Musik und schafft so eine gehobene, verführerische Atmosphäre.   Bei \"Pinky Jazz\" zelebrieren wir den Nervenkitzel der Live-Musik und zollen legendären Sängern und Sängerinnen Tribut, während wir gleichzeitig den verspielten, leicht gewagten Touch von \"Kinky\" in \"Pinky\" einfließen lassen.   Als Visionärin dieses Konzepts möchte ich unseren Gästen ein sinnliches Erlebnis bieten, das Sie in seinen Bann zieht und Ihnen die Möglichkeit gibt, Ihre Fantasien in einer geschmackvollen und dennoch aufregenden Umgebung auszuleben.",
        "externalId": "4257",
        "externalPicture": "https://www.insomnia-berlin.de/galpics/galleries/eventflyer/medium/0000085085.jpg",
        "link": "https://www.insomnia-berlin.de/partys_party-detail.html?id=4257",
        "tags": [
            "Sexpositive",
            "Erotic",
            "Fetish",
            "Jazz",
            "House",
            "Swinger",
            "BDSM"
        ],
        "fromDate": "05.06"
    },
    {
        "title": "Velvet Cougars",
        "fromTime": "20:00",
        "description": "Die lüsterne Swingerparty für aktive Paare & Singles Open Bar & Whirlpool Dresscode: Sexy – Dessous – Verführerisch All inclusive* Getränke: Paare 75€ - Herren 75€ / Toyboys bis 28 Jahre 50€ - Damen 25€ Early Bird bis 21:00 Discount €10 auf den Eintrittpreis für Paare & Frauen!<hr>Diese Nacht ist voller Begehren und Leidenschaft, wenn sich versierte Verführerinnen und standhafte Herren in lüsterner Atmosphäre treffen. Bei \"Velvet Cougars\" zeigen erfahrene Ladys der neuen Generation von Liebhabern, nach welchen Regeln der Kunst die fleischlichen Gelüste dirigiert werden.   Cougars sind die weibliche Verkörperung von Erfahrung und Leidenschaft. Sie wissen genau, was sie wollen und sind bereit, ihre geheimen Tricks und Techniken zu teilen.  \"Toyboys\" sind willige, charmante Liebhaber, die bereit sind, sich von den reifen Ladys in die Welt der Sinnlichkeit entführen zu lassen. Sie sind neugierig, aufgeschlossen und voller Energie, um die wildesten Fantasien Wirklichkeit werden zu lassen.  Diese Swinger-Party bietet die perfekte Gelegenheit, erotischen Träume auszuleben und neue Höhepunkte der Lust zu erreichen. Abenteuerlustige Paare, die nach männlicher Verstärkung suchen und neugierige Singles mit Niveau sind herzlich willkommen, die aufregende Atmosphäre dieser Veranstaltung zu genießen.  Dies ist eine Sex Party und wir wünschen uns aktive Teilnehmer die sich in einvernehmlichen Situationen begegnen. Wer sich erst einmal umsehen möchten, erste vorsichtige Schritte wagen will, empfehlen wir Freitag/Samstag mit erotischen Tanz - und Mottopartys.  Bei uns herrscht Aktiver Konsens, d.h. erst fragen, dann anfassen. Wer swingen will, sollte freundlich und offen auf andere zugehen ohne dabei penetrant zu sein. Wer SM Spielchen machen will, muss den richtigen Ton finden! Ein “Nein” ist ein “Nein” und wird auch nicht diskutiert!  *außer Champagner & Cocktails",
        "externalId": "3987",
        "externalPicture": "https://www.insomnia-berlin.de/galpics/galleries/eventflyer/medium/0000083228.jpg",
        "link": "https://www.insomnia-berlin.de/partys_party-detail.html?id=3987",
        "tags": [
            "Sexpositive",
            "Erotic",
            "Fetish",
            "Burlesque",
            "Swinger",
            "BDSM"
        ],
        "fromDate": "06.06"
    },
    {
        "title": "AUA! BDSM Party for Beginners and Experienced Players",
        "fromTime": "20:00",
        "description": "SM & Fetischparty für Paare, Polys, Singles Host of the Evening Kinky Amy führt in die Welt des BDSM ein Dresscode: sexy – kinky – elegant – fetish – dessous – lingerie - black underwear   All inclusive* Drinks: Paare 75€ / Herren 75€ (bis 28 Jahre 50€)  / Damen 25€<hr>AUA! schreit es durch den Keller, an diesem verruchten Donnerstag: Die wundervolle Welt des BDSM gibt es an diesem Abend zu entdecken!   Bist Du auf der Suche nach einem sicheren Einstieg in das BDSM-Spiel und möchtest erste Erfahrungen sammeln oder Kenntnisse vertiefen? Hast Du Lust, Deine geheimen Vorlieben zu erkunden und auszuleben?   Unsere Gastgeberin des Abends, Lady Kinky Amy, heißt alle Interessierten herzlich willkommen, steht mit Rat und Tat zur Seite und präsentiert die vielfältigen Spielarten und Varianten der etwas härteren Lust.  Um eine sinnliche Atmosphäre zu schaffen, sind zu Beginn des Abends passende Vorführungen von BDSM-Praktiken geplant.  „AUA!“ ist eine Fetisch- und Sex-Positive-Party, auf der Einvernehmlichkeit an erster Stelle steht! Nein bedeutet Nein! Nur ein klares Ja ist ein Ja! Die Zustimmung für jegliche Interaktionen ist unerlässlich! Frage immer höflich nach und respektiere die Antwort!  - Lerne Deine Fetische und das BDSM-Spiel spielerisch in einem Safe Space kennen - Leihe Dir BDSM Spielzeug aus oder bringe Dein eigenes Spielzeug mit - Triff andere BDSM Interessierte in einer entspannten lockeren Atmosphäre  - Lass Dir BDSM Praktiken zeigen, spiele selbst in den Play Areas des Kellers oder schaue zu - Entspannte Techno-Musik wird Euch beim Spielen und Experimentieren durch den Abend begleiten  - Fühle Dich frei, sei ganz Du selbst und respektiere die Grenzen der Anderen   Dresscode: sexy – kinky – elegant – fetish – dessous – lingerie - black underwear - keine Straßenkleidung     *außer Champagner & Cocktails",
        "externalId": "4040",
        "externalPicture": "https://www.insomnia-berlin.de/galpics/galleries/eventflyer/medium/0000083391.jpg",
        "link": "https://www.insomnia-berlin.de/partys_party-detail.html?id=4040",
        "tags": [
            "Sexpositive",
            "Erotic",
            "Fetish",
            "Burlesque",
            "Swinger",
            "BDSM"
        ],
        "fromDate": "06.06"
    },
    {
        "title": "YOUNG LOVE ",
        "fromTime": "22:00",
        "description": "Die sex-positive Electro-House-Party für Youngsters & Junggebliebene, Freaks & Kinky People Melodic Techno, Techhouse & Techno by DJs Hedo, Ben Green & Paradoxx  BDSM-Katakomben & Paar-Empore geöffnet ab 22 Uhr Love Patrol - Awareness-Team Dresscode: Kinky, Black Glamour, Fetish, BDSM, Clubwear, keine Straßenkleidung! Einlass für Youngster von 18-25 Jahren frei! Eintritt: Pro Person 25€ / Studenten & Sozial Ticket* 15€<hr><a name=\"Index_1\"></a><h2>Young Love</h2>Seit mehr als einem Jahrzehnt wummern bei uns Freitags die Technobässe, dargereicht von ganz besonderen Perlen unter den DJs der Hauptstadt und ein junges Publikum strömt in den unheiligen Tanztempel, wenn „Young Love“ auf dem Flyer steht.  Eine Mischung von Gästen, wie sie aufregender nicht sein kann mit sexy Freaks, jungen Hüpfern, glamorösen Clubbern und leckeren Nachtschwärmern darf sich diesmal auf eine besonders tanzbare Kombination freuen.  Berliner DJs und nationale Acts stehen an den Turntables und spielen einen Sound, wie er so nur auf der \"Young Love\" zu erleben ist. Anspruchsvoll. Treibend. Innovativ.  Und während in der Mainhall abgerockt wird, vergnügen sich abenteuerlustige Gäste in den BDSM-Katakomben, der Paar-Empore oder dem Jacuzzi. Eine Love-Patrol ist immer im Club unterwegs, sorgt für Eure Sicherheit und ist immer ansprechbar.  Und das alles in einem Club, in dem sich alle Altersklassen wohlfühlen, und sich auch trauen neue Pfade der Leidenschaft zu erklimmen oder einfach nur wild abzufeiern - dem INSOMNIA.  Auch in den finanziell oft schwierigen Zeiten nach der Pandemie wollen wir weiterhin allen Youngsters eine Freude bereiten und allen Besuchern zwischen 18 und 25 Jahren freien Eintritt gewähren.  Ein Awareness-Team ist immer im Club unterwegs, sorgt für Eure Sicherheit und ist immer ansprechbar.  *Sozial bzw. Studententicket bitte mit entsprechendem Nachweis (Studi Ausweis, Sozialticket BVG etc.) an der Abendkasse",
        "externalId": "4051",
        "externalPicture": "https://www.insomnia-berlin.de/galpics/galleries/eventflyer/medium/0000085072.jpg",
        "link": "https://www.insomnia-berlin.de/partys_party-detail.html?id=4051",
        "tags": [
            "Sexpositive",
            "Erotic",
            "Fetish",
            "Techno",
            "House"
        ],
        "fromDate": "07.06"
    },
    {
        "title": "3 Jahre Hedomanie",
        "fromTime": "22:00",
        "description": "3 Jahre Hedomanie Two Floor Techno Play Party mit besonderen Performances, Dekoration und Awareness Team von ArtIDicction Collective  Techno, Hard Groove, Trance und House Musik von Cotumo (Ritter Butzke, Sisyphos) , Maniac Lina (Prisma), Wiebe Roose (ArtIDicction Resident) und DJ Kollektiv aus Belgien: Kompass Traxx! Couples Area, BDSM Dungeon und Playareas ab 22 Uhr geöffnet Dresscode: Fantasy, Fetisch, Sexy, Black Glamour, Kinky, Wild  Eintritt: 25€ an der Kasse<hr>HEDOMANIE: Glamour und Glitzer: Drei Jahre hedonistische Glückseligkeit!  Save the date und mach Dich bereit für eine unvergleichliche Nacht der Freude, in der wir die triumphale Reise unserer Hedomanie feiern, die nun in ihr viertes Jahr ihrer elektrisierenden Existenz geht!  2 Dancefloors mit Maniac Lina, Wiebe Roose, Cotumo, Kompass Traxx und vielen mehr Seit drei Jahren ist die Hedomanie das pulsierende Herz des hedonistischen Ausdrucks, wo die Beats die Sehnsüchte widerspiegeln und jeder Moment unter die Haut geht. Diese Jubiläumsausgabe verspricht ein extravagantes Fest, das die Grenzen unserer wildesten Fantasien überschreitet.  Was Du erwarten kannst:  RETROSPEKTIVE BEATS: Tauche ein in eine klangliche Reise durch die Beats, die unsere hedonistischen Eskapaden bestimmt haben. Unsere DJs, die Maestros hinter den Decks, werden einen Mix auflegen, der die Zeitachse unserer aufregenden dreijährigen Odyssee durchläuft.  Für diese Ausgabe: Cotumo (Sisyphos, Ritter Butzke) Kompass Traxx (Kompass Klub Belgien) Maniac Lina (Kit Kat Club, Klitball) Wiebe Roose (ArtIDicction)  TRIUMPHALE THEMEN: Erlebe die Magie vergangener Themen, die unsere Nächte mit Farbe und Energie gefüllt haben. Vom mystischen Wald bis zum ätherischen Himmel & Hölle, jede Ausgabe war ein Kapitel in unserer hedonistischen Geschichte. In dieser Nacht verschmelzen die Themen zu einer großen Feier der Vielfalt und Einheit.  LEBENDIGE KUNSTGALERIE: Erlebe die Verwandlung des Veranstaltungsortes in eine lebende Kunstgalerie, in der die visuellen Meisterwerke und Installationen gezeigt werden, die das Hedomanie über die Jahre hinweg geschmückt haben. Jedes Stück ist ein Zeugnis für die künstlerische Seele unseres Kollektivs.  BESONDERE AUFFÜHRUNGEN: Erlebe atemberaubende Performances, die die Grenzen der Kreativität erweitern. Von faszinierenden Tanzdarbietungen bis hin zu Live-Kunstinstallationen - unsere Jubiläumsausgabe ist eine Bühne für das Außergewöhnliche. Als Teil unseres wunderbaren ArtIDicction-Kollektivs, das sich immer wieder selbst erneuert, haben wir De Weirdo Mary eingeladen, bei dieser wilden Ausgabe aufzutreten! Erwarte etwas Ungewöhnliches!  ÜBERRASCHUNGEN ENTHÜLLEN: Mach Dich auf Überraschungen und Köstlichkeiten gefasst, die über die ganze Nacht verteilt sind. Von interaktiven Installationen bis hin zu exklusiven Giveaways - diese Feier ist unser Geschenk an die lebendige Gemeinschaft, die die Hedomanie zu dem gemacht hat, was sie heute ist.  INTERAKTIVE SPANKING-STATION: Unser Meister des Schmerzes wird Dich mit Vergnügen in die hohe Kunst des Empfangens und Verabreichens von sanfteren und härteren Berührungen einführen, ohne dass Du dabei deine Zustimmung geben musst!  Komm zu Peppe's pain booth! Feiere mit uns drei Jahre hedonistische Freude und die Kraft der Einheit im Hedonismus. Melde dich jetzt an und werde Teil dieser triumphalen Trilogie!",
        "externalId": "4112",
        "externalPicture": "https://www.insomnia-berlin.de/galpics/galleries/eventflyer/medium/0000085336.jpg",
        "link": "https://www.insomnia-berlin.de/partys_party-detail.html?id=4112",
        "tags": [
            "Sexpositive",
            "Erotic",
            "Fetish",
            "Techno",
            "House"
        ],
        "fromDate": "08.06"
    }
]