[
    {
        "datum": "01.Jun",
        "fromTime": "23h",
        "title": "CarneBall Bizarre-KitKatClubnacht",
        "description": "Monty, Jam El Mar, Don Tom, Chaos Techno Berlin und Cabaret Sultana. Bereits ab 20 Uhr im Basement: Stolz und Demut. Ab ca. 1 Uhr: Disco Bizarre im 4. Raum, im Basement: My Secret Playground, Florian Loveshack und D.J. himself. Salon Rouge (ab ca. 2 Uhr), im 5. Raum, im Basement: DJ FoxMind. Prisma Floor: Rochelle Baz, Distelfink und Cheesebeat. Sauna, Outdoorarea, Playspace, Candy-Shop, etcetera .... :-) Kinky, Fetish, Gothik, Lack &amp; Leder, Kostüme, Glitzer &amp; Glamour, elegante Abendgarderobe, Außergewöhnliches jeder Art. Bunte Outfits werden bevorzugt! KEINE normale Straßenkleidung. Jeans &amp; Sportschuhe sind verboten! Normale Unterhosen auch. Wir sind kein Swingerclub. Anfassen, ohne das Einverständnis des Gegenübers, oder beim Vorübergehen, führt zu Hausverbot. Lebenslänglich."
    },
    {
        "datum": "02.Jun",
        "fromTime": "08h",
        "title": "Nachspiel-Afterhour: Carpe Diem!",
        "description": "Match Hoffman, Daora Techno, Electro \"The most famous Sunday Afterhour at KitKatClub. Sex-positive and queer-friendly Party Edition - kinky style! Hot or freaky, nerdy or beardy: everyone is welcome! Follow the rhythm of electronic music and be feel happy the way you are.\" Huge chill out areas, Swimming pool. Dress to impress! No street wear - no Jeans &amp; no T-Shirts."
    },
    {
        "datum": "02.Jun",
        "fromTime": "22h",
        "title": "Somnambul BLN",
        "description": "Max Muth, Mila Dietrich, Tom Cordes Techno, Electro TheSundayNightElectronicDanceExperience@KitKatClub! \"On Sunday from 10 p.m., the Somnambul BLN celebrates, loves and dances without a strict dress code, but all the more freely. (...) Everything else is as usual at the KitKat: anything might happen - everything is possible - and nothing is obligatory.\" Outdoor pool area is open. No strict Dresscode … be yourself!"
    },
    {
        "description": ""
    },
    {
        "datum": "03.Jun",
        "fromTime": "19h",
        "title": "Tango Rouge Sensual Monday with Bachata &amp; Kizomba",
        "description": "DJ Dilara Ogretmen, DJ Hach Entry from 18:45/Einlass ab 18 Uhr 45. 19:00 classes in Tango, Bachata &amp; Kizomba. Tango Introduction with Pedram Shahyar, Close Embrace with Malachai Payne, Tango Technique and Musicality with Leandro Furlan. Bachata open level with Kyana &amp; Emin. Kizomba open level with Sara &amp; Pam. No experience and no partner needed! 21:00 Party on 2 floors.<br><br>Our venue, Berlin's legendary KitKatClub, is a sex positive space where everyone can (doesn't have to) explore and express their sexuality without judgement and shame. Needless to say: Consent is always key. No dress code on Monday - but you are very welcome to dress to impress!"
    },
    {
        "datum": "03.Jun",
        "fromTime": "22h",
        "title": "Electric Monday",
        "description": "Annina &amp; Scoopsi, Andre Lodemann, Berkita, Frankie Flowerz, Ricardo Rodriguez Techno, House \"Enjoy the Vibe &amp; Get Freaky. Bring &amp; Share Love as Usual!\" Come As You Are and do Dress n Express yourself, KitKat style - colourful, fancy, wild, different, kinky, smart - most of all be authentic."
    },
    {
        "datum": "04.Jun",
        "fromTime": "22h",
        "title": "Illusion",
        "description": "Serioes &amp; Legendaer b2b Little Duracell (live), Frankov Techno \"Step into an enchanting realm where the ordinary gives way to the extraordinary at Illusion. (...) Let go of inhibitions as you immerse yourself in the pulsing energy that fills the air.\" Kinky, playful, extravagant, latex, leather, mesh, costumes - be creative and brave. No streetwear!"
    },
    {
        "datum": "05.Jun",
        "fromTime": "22h",
        "title": "Symbiotikka",
        "description": "Jose Bonetto, Jordan, Vom Feisten, Zagroza Techno \"Expand your horizon and have a look over the edge. Celebrate with us Respect, Freedom, Love and Music!\" Kinky Shows live, Bondage Show live, Playspace, Bodypainting, Pool and some special surprises... Be particular, creative, sexy, wicked, kinky, especially or crazy. But never boring!"
    },
    {
        "datum": "06.Jun",
        "fromTime": "19h",
        "title": "Vernissage: CLIMAX and VULNERABILITY by Marcello Castellani",
        "description": "„Climax and Vulnerability by Marcello Castellani invites the viewer on an intimate journey through body self-portraits and the representation of ecstasy. With eight small-format works and two large-format pieces, the artist explores their nudity and sensuality for the first time, challenging their comfort zone.“ Vernissage/Exhibition will take place in Salon Rouge in the basement of KitKatClub. Live &amp; Dj set by Soviet Gym. Free entry, donations based. Entrance via Ohmstrasse 11, follow the red lights. More informations about the exhibition and the artist:<br><br>https://www.facebook.com/events/1498262671043872 No dress code."
    },
    {
        "datum": "06.Jun",
        "fromTime": "22h",
        "title": "Human Colours X Hexenwerk Festival",
        "description": "Je Saré, Macho Milano, Der Eggert, Modulatos, Christoph Kuhlmann, Somaphon, Milk`N Coffee, Schnabeln &amp; Saugen Techno, Tech House „We bring Techno, Burlesque and Body Art every first Thursday at KitKatClub! (...) The universe is full of colors and sounds that vibrate together.“ Kinky Body Painting by Thaly White – LightgoesDark. Secret Burlesque Performance by Maria Mané. This time we have two selected dancers for you to enchant your senses. Attention, we are the original KitKat party this evening, LEFT ENTRANCE! There is another external event in the upper area of the club. More informations and pre-sale tickets:<br><br>https://de.ra.co/events/1821597"
    },
    {
        "datum": "07.Jun",
        "fromTime": "22h",
        "title": "Four Play 8th Anniversary",
        "description": "Any Mello, Camea, Hang Aoki, Jon Hester, Lina, N.E.O., Niemand &amp; Keiner, Wanda Wild, Mømentum, Mi-Ka, Philipp Gorbachev, Thor Rixon, The Naked Tea Party. Salon Rouge: 5 String Theory (live concert), Kraut Pleasure Techno, House „8 YEARS FOUR PLAY! 8 years of making our scene lighter, more colorful, and happier. (…) 8 years, and we have only just started!“ 5 Floors, Basement area open. Performer Program: artEmiss Collective, Burlesque Show by Eros, Dream Circus Pirates, Dream Worlds: Scissortopia, Evilyn Frantic, Maia Friend. Stations and Activities: Erotic Tarot Reading, Kinky Booth, Pokemon Center Massage Clinic, Sexify Happenings, Sketch Artists, The Naked Tea Party. The CODE Kindergarten: Frau Dark, The Naughty Ballosint, The Naughty Clown, The Naughty Educator, The Naughty Nanny. Kinky Market Place by GammaWear, IMPOPSIBILE, Shimmies. More informations:<br><br>https://de.ra.co/events/1832696 Sexy swimsuits, costumes, leather, latex, naked, super heroes, lingerie, colorful festival style. No casual street wear such as jeans is allowed!"
    },
    {
        "datum": "08.Jun",
        "fromTime": "19h",
        "title": "Tango Rouge at CarneBall Bizarre",
        "description": "19:00 Entrance Buffet. 19:30 Classes in Argentine Tango: No experience and no partner needed – come alone, as a couple or bring some friends! 2 Classes, Beginners Class: Introduction to Tango. Dramatic &amp; playful figures. 21:00 Tango Party in Salon Rouge. Live music and Performances all night long. Entry from 19:00/Einlass ab 19:00 Uhr, you need to be there before 21:00. The entry is valid for the whole Saturday night in all areas of KitKatClub. Playful, kinky, fetish, carnival, crazy, sexy, extremely elegant Tango. Casual dress = no entry!"
    },
    {
        "datum": "08.Jun",
        "fromTime": "23h",
        "title": "CarneBall Bizarre-KitKatClubnacht",
        "description": "(tba). Disco Bizarre im 4. Raum, im Basement: Chris Gavin, Early Grey und Billy Idle. Salon Rouge (ab 1 Uhr 30), im 5. Raum, im Basement: DJ Dad of the year (slowtempo) + sensual duo dance performance around 01:30am (Towadei). Prisma Floor: DJ Hach (Bachata 19-24 Uhr), The Shredder, ubersaat. Sauna, Outdoorarea, Playspace, Candy-Shop, etcetera .... :-) Kinky, Fetish, Gothik, Lack &amp; Leder, Kostüme, Glitzer &amp; Glamour, elegante Abendgarderobe, Außergewöhnliches jeder Art. Bunte Outfits werden bevorzugt! KEINE normale Straßenkleidung. Jeans &amp; Sportschuhe sind verboten! Normale Unterhosen auch. Wir sind kein Swingerclub. Anfassen, ohne das Einverständnis des Gegenübers, oder beim Vorübergehen, führt zu Hausverbot. Lebenslänglich."
    },
    {
        "datum": "09.Jun",
        "fromTime": "08h",
        "title": "Nachspiel-Afterhour: Carpe Diem!",
        "description": "Marcel db/B-Day, DJ Funk@delic, Gizmo Techno, Electro \"The most famous Sunday Afterhour at KitKat Club. Sex-positive and queer-friendly Party Edition - kinky style! Hot or freaky, nerdy or beardy: everyone is welcome! Follow the rhythm of electronic music and be feel happy the way you are.\" Huge chill out areas, Swimming pool. Dress to impress! No street wear - no Jeans &amp; no T-Shirts."
    },
    {
        "datum": "09.Jun",
        "fromTime": "10h",
        "title": "Breakfast Club + Classical Sundays",
        "description": "Classical Concert (from 14.00) It’s that time again! The Breakfast Club kicking off our Summer Edition, starting earlier, chilling harder with Classical Sundays interventions again. :-) This Sunday 09/06 we host a special classical concert, last time at KitKat until the fall! We open already 9:15! Brunch starts at 11.00, concert at 14.00. Tickets at the door, 5 € min donation at the door for the program! Extra donations box for Breakfast buffet inside. Entrance via Ohmstrasse 11, follow the signs… Bring your cozy clothes n house shoes (we got you if not), come in a state of contenance, no dress code required. Comfy. :-)"
    },
    {
        "datum": "09.Jun",
        "fromTime": "22h",
        "title": "Somnambul BLN",
        "description": "Gallya, Spicy Flamingo, Vlad Yaki Techno, Electro TheSundayNightElectronicDanceExperience@KitKatClub! \"On Sunday from 10 p.m., the Somnambul BLN celebrates, loves and dances without a strict dress code, but all the more freely. (...) Everything else is as usual at the KitKat: anything might happen - everything is possible - and nothing is obligatory.\" Outdoor pool area is open. No strict Dresscode … be yourself!"
    },
    {
        "description": ""
    },
    {
        "datum": "10.Jun",
        "fromTime": "19h",
        "title": "Tango Rouge",
        "description": "(tba) 3 Tango classes (beginners, intermediate, advanced) from 7 pm. You don't need a partner for the classes - you can come alone, as a couple or in a group. Tango Party from 9 pm. Entry from 6:45 pm/Einlass ab 18 Uhr 45.<br><br>Our venue, Berlin's legendary KitKatClub, is a sex positive space where everyone can (doesn't have to) explore and express their sexuality without judgement and shame. Needless to say: Consent is always key. No dress code on Monday - but you are very welcome to dress to impress!"
    },
    {
        "datum": "10.Jun",
        "fromTime": "22h",
        "title": "Electric Monday",
        "description": "Justin Massei, Hi Hat Dancer, Soltight, Ricardo Rodriguez, Frankie Flowerz Techno, House \"Enjoy the Vibe &amp; Get Freaky. Bring &amp; Share Love as Usual!\" Come As You Are and do Dress n Express yourself, KitKat style - colourful, fancy, wild, different, kinky, smart - most of all be authentic."
    },
    {
        "datum": "11.Jun",
        "fromTime": "19h",
        "title": "Erotic Life Drawing",
        "description": "Erotic Life Drawing (Aktzeichnen) in Salon Rouge Floor (Raum 5) in the Basement of KitKatClub, featuring Sex Workers models. Next session Tuesday 11th of June, from 7pm til 10pm or later! Bring your own materials: „Get ready for a sexy evening of erotic art to welcome our summer pausa! (…) These sessions seeks to explore the deep relationship between art and er/o/tism.“ DJ special guest @dotdash_eisheth coum. Separate entrance through the backyard via Ohmstrasse 11, follow the signs &amp; the red lanterns! Entrance fee by donations, recommended 10-20 Euro. More informations (auch in deutscher Sprache):<br><br>https://www.facebook.com/events/1613399692773299 No dress code."
    },
    {
        "datum": "11.Jun",
        "fromTime": "22h",
        "title": "Illusion",
        "description": "Kaan Deniz Ertürk, Fræd b2b Zeitfrei Techno \"Step into an enchanting realm where the ordinary gives way to the extraordinary at Illusion. (...) Let go of inhibitions as you immerse yourself in the pulsing energy that fills the air.\" Kinky, playful, extravagant, latex, leather, mesh, costumes - be creative and brave. No streetwear!"
    },
    {
        "datum": "12.Jun",
        "fromTime": "22h",
        "title": "Symbiotikka – Chris B-Day Special",
        "description": "Mija, Lovra, Jordan, Anubix Techno \"Expand your horizon and have a look over the edge. Celebrate with us Respect, Freedom, Love and Music!\" Kinky Shows live, Bondage Show live, Playspace, Bodypainting, Pool and some special surprises... Be particular, creative, sexy, wicked, kinky, especially or crazy. But never boring!"
    },
    {
        "datum": "13.Jun",
        "fromTime": "22h",
        "title": "Psycho Benecke",
        "description": "Mark Benecke, Coon, Ari, Match Hoffman, Johnson Patrick Techno, Psytrance \"Where Psy meets Techno. In the basement of KitKatClub.“ Performance, Play Area, Photos. Welcomes: LGBTQ, Body positivity, Inked. Pre-sale tickets:<br><br>https://de.ra.co/events/1931167"
    },
    {
        "datum": "14.Jun",
        "fromTime": "22h",
        "title": "Revolver Party",
        "description": "Moussa, Hendrik Milan, Federico Maniscalco, Tiefton, Oliver M, Jaycap, 2Faro, Kitty Vader Revolver is the monthly gay party event in KitKatClub. “Our events are safe spaces for queer and trans men and are THEREFORE strictly men only!“ Buy your tickets: <br><br>https://revolverparty.com/tickets Fetish clothing, jockstraps, mesh shirts, sporty outfits. The more creative, the better!"
    },
    {
        "datum": "15.Jun",
        "fromTime": "19h",
        "title": "Tango Rouge at CarneBall Bizarre",
        "description": "19:00 Entrance Buffet. 19:30 Classes in Argentine Tango: No experience and no partner needed – come alone, as a couple or bring some friends! 2 Classes, Beginners Class: Introduction to Tango. Dramatic &amp; playful figures. 21:00 Tango Party in Salon Rouge. Live music and Performances all night long. Entry from 19:00/Einlass ab 19:00 Uhr, you need to be there before 21:00. The entry is valid for the whole Saturday night in all areas of KitKatClub. Playful, kinky, fetish, carnival, crazy, sexy, extremely elegant Tango. Casual dress = no entry!"
    },
    {
        "datum": "15.Jun",
        "fromTime": "23h",
        "title": "CarneBall Bizarre-KitKatClubnacht",
        "description": "(tba). Disco Bizarre im 4. Raum, im Basement: Giacomo Virzi, (tba) und Billy Idle. Salon Rouge (ab 2 Uhr), im 5. Raum, im Basement: The Shredder. Prisma Floor: (tba). Sauna, Outdoorarea, Playspace, Candy-Shop, etcetera .... :-) Kinky, Fetish, Gothik, Lack &amp; Leder, Kostüme, Glitzer &amp; Glamour, elegante Abendgarderobe, Außergewöhnliches jeder Art. Bunte Outfits werden bevorzugt! KEINE normale Straßenkleidung. Jeans &amp; Sportschuhe sind verboten! Normale Unterhosen auch. Wir sind kein Swingerclub. Anfassen, ohne das Einverständnis des Gegenübers, oder beim Vorübergehen, führt zu Hausverbot. Lebenslänglich."
    },
    {
        "datum": "16.Jun",
        "fromTime": "08h",
        "title": "Nachspiel-Afterhour: Carpe Diem!",
        "description": "Anne Decks, Miss Sunshine Techno, Electro \"The most famous Sunday Afterhour at KitKat Club. Sex-positive and queer-friendly Party Edition - kinky style! Hot or freaky, nerdy or beardy: everyone is welcome! Follow the rhythm of electronic music and be feel happy the way you are.\" Huge chill out areas, Swimming pool. Dress to impress! No street wear - no Jeans &amp; no T-Shirts."
    },
    {
        "datum": "16.Jun",
        "fromTime": "22h",
        "title": "Somnambul BLN",
        "description": "Badwolf, Boho, Gaya Brisa Techno, Electro TheSundayNightElectronicDanceExperience@KitKatClub! \"On Sunday from 10 p.m., the Somnambul BLN celebrates, loves and dances without a strict dress code, but all the more freely. (...) Everything else is as usual at the KitKat: anything might happen - everything is possible - and nothing is obligatory.\" Outdoor pool area is open. No strict Dresscode … be yourself!"
    },
    {
        "description": ""
    },
    {
        "datum": "17.Jun",
        "fromTime": "19h",
        "title": "Tango Rouge",
        "description": "(tba) 3 Tango classes (beginners, intermediate, advanced) from 7 pm. You don't need a partner for the classes - you can come alone, as a couple or in a group. Tango Party from 9 pm. Entry from 6:45 pm/Einlass ab 18 Uhr 45.<br><br>Our venue, Berlin's legendary KitKatClub, is a sex positive space where everyone can (doesn't have to) explore and express their sexuality without judgement and shame. Needless to say: Consent is always key. No dress code on Monday - but you are very welcome to dress to impress!"
    },
    {
        "datum": "17.Jun",
        "fromTime": "22h",
        "title": "Electric Monday",
        "description": "Nils Ohrmann, BB Deng, Frankie Flowerz, Ricardo Rodriguez Techno, House \"Enjoy the Vibe &amp; Get Freaky. Bring &amp; Share Love as Usual!\" Come As You Are and do Dress n Express yourself, KitKat style - colourful, fancy, wild, different, kinky, smart - most of all be authentic."
    },
    {
        "datum": "18.Jun",
        "fromTime": "22h",
        "title": "Illusion",
        "description": "Ryan Nasty, Anyzoba Techno \"Step into an enchanting realm where the ordinary gives way to the extraordinary at Illusion. (...) Let go of inhibitions as you immerse yourself in the pulsing energy that fills the air.\" Kinky, playful, extravagant, latex, leather, mesh, costumes - be creative and brave. No streetwear!"
    },
    {
        "datum": "19.Jun",
        "fromTime": "22h",
        "title": "Symbiotikka Goddesses Special",
        "description": "A.n.i., Grace Thompson, Stuckeyrella, Eloisa, SaltySis, Noom1, Gea, Cara Elizabeth Trance, Techno After the overwhelming success of the Symbiotikka Goddesses Parties, the next edition. Let's celebrate the divine femininity, or female divinity together. 8 female DJs on 2 floors. Kinky Shows live, Bondage Show live, Playspace, Bodypainting, Pool and some special surprises... Be particular, creative, sexy, wicked, kinky, especially or crazy. But never boring!"
    },
    {
        "datum": "21.Jun",
        "fromTime": "22h",
        "title": "The Mystic Rose meets ATACAMA",
        "description": "Jensson, Boom Shankar, Atacama, Chris A Nova, Mad Gorix, Kaspar Krug b2b Pabel Techno, Psytrance 3 floors. Visuals &amp; Arts: Fun Plastica, Bodypainting, Hypnotikal Laser Productions. Spacebar by Ganesh, Massagen by Collin. No Dresscode... Just be yourself... But be sexy..."
    },
    {
        "datum": "22.Jun",
        "fromTime": "19h",
        "title": "Tango Rouge at CarneBall Bizarre",
        "description": "19:00 Entrance Buffet. 19:30 Classes in Argentine Tango: No experience and no partner needed – come alone, as a couple or bring some friends! 2 Classes, Beginners Class: Introduction to Tango. Dramatic &amp; playful figures. 21:00 Tango Party in Salon Rouge. Live music and Performances all night long. Entry from 19:00/Einlass ab 19:00 Uhr, you need to be there before 21:00. The entry is valid for the whole Saturday night in all areas of KitKatClub. Playful, kinky, fetish, carnival, crazy, sexy, extremely elegant Tango. Casual dress = no entry!"
    },
    {
        "datum": "22.Jun",
        "fromTime": "23h",
        "title": "CarneBall Bizarre-KitKatClubnacht",
        "description": "(tba). Disco Bizarre im 4. Raum, im Basement: Franz Scala, (tba) und Shimanski. Salon Rouge (ab 2 Uhr), im 5. Raum, im Basement: DJ Till Noon. Prisma Floor: (tba). Sauna, Outdoorarea, Playspace, Candy-Shop, etcetera .... :-) Kinky, Fetish, Gothik, Lack &amp; Leder, Kostüme, Glitzer &amp; Glamour, elegante Abendgarderobe, Außergewöhnliches jeder Art. Bunte Outfits werden bevorzugt! KEINE normale Straßenkleidung. Jeans &amp; Sportschuhe sind verboten! Normale Unterhosen auch. Wir sind kein Swingerclub. Anfassen, ohne das Einverständnis des Gegenübers, oder beim Vorübergehen, führt zu Hausverbot. Lebenslänglich."
    },
    {
        "datum": "23.Jun",
        "fromTime": "08h",
        "title": "Nachspiel-Afterhour: Carpe Diem!",
        "description": "Coon, Kenny Techno, Electro \"The most famous Sunday Afterhour at KitKat Club. Sex-positive and queer-friendly Party Edition - kinky style! Hot or freaky, nerdy or beardy: everyone is welcome! Follow the rhythm of electronic music and be feel happy the way you are.\" Huge chill out areas, Swimming pool. Dress to impress! No street wear - no Jeans &amp; no T-Shirts."
    },
    {
        "datum": "23.Jun",
        "fromTime": "22h",
        "title": "Somnambul BLN",
        "description": "Ante Perry, Bianka Banks, Extennisspieler Techno, Electro TheSundayNightElectronicDanceExperience@KitKatClub! \"On Sunday from 10 p.m., the Somnambul BLN celebrates, loves and dances without a strict dress code, but all the more freely. (...) Everything else is as usual at the KitKat: anything might happen - everything is possible - and nothing is obligatory.\" Outdoor pool area is open. No strict Dresscode … be yourself!"
    }
]