[{"title":"YOUNG LOVE ","fromTime":"22:00","description":"Die sex-positive Electro-House-Party für Youngsters & Junggebliebene, Freaks & Kinky People Melodic Techno, Techhouse & Techno by DJs Hedo, Ben Green & Paradoxx  BDSM-Katakomben & Paar-Empore geöffnet ab 22 Uhr Love Patrol - Awareness-Team Dresscode: Kinky, Black Glamour, Fetish, BDSM, Clubwear, keine Straßenkleidung! Einlass für Youngster von 18-25 Jahren frei! Eintritt: Pro Person 25€ / Studenten & Sozial Ticket* 15€<hr><a name=\"Index_1\"></a><h2>Young Love</h2>Seit mehr als einem Jahrzehnt wummern bei uns Freitags die Technobässe, dargereicht von ganz besonderen Perlen unter den DJs der Hauptstadt und ein junges Publikum strömt in den unheiligen Tanztempel, wenn „Young Love“ auf dem Flyer steht.  Eine Mischung von Gästen, wie sie aufregender nicht sein kann mit sexy Freaks, jungen Hüpfern, glamorösen Clubbern und leckeren Nachtschwärmern darf sich diesmal auf eine besonders tanzbare Kombination freuen.  Berliner DJs und nationale Acts stehen an den Turntables und spielen einen Sound, wie er so nur auf der \"Young Love\" zu erleben ist. Anspruchsvoll. Treibend. Innovativ.  Und während in der Mainhall abgerockt wird, vergnügen sich abenteuerlustige Gäste in den BDSM-Katakomben, der Paar-Empore oder dem Jacuzzi. Eine Love-Patrol ist immer im Club unterwegs, sorgt für Eure Sicherheit und ist immer ansprechbar.  Und das alles in einem Club, in dem sich alle Altersklassen wohlfühlen, und sich auch trauen neue Pfade der Leidenschaft zu erklimmen oder einfach nur wild abzufeiern - dem INSOMNIA.  Auch in den finanziell oft schwierigen Zeiten nach der Pandemie wollen wir weiterhin allen Youngsters eine Freude bereiten und allen Besuchern zwischen 18 und 25 Jahren freien Eintritt gewähren.  Ein Awareness-Team ist immer im Club unterwegs, sorgt für Eure Sicherheit und ist immer ansprechbar.  *Sozial bzw. Studententicket bitte mit entsprechendem Nachweis (Studi Ausweis, Sozialticket BVG etc.) an der Abendkasse","externalId":"4051","externalPicture":"https://www.insomnia-berlin.de/galpics/galleries/eventflyer/medium/0000085072.jpg","link":"https://www.insomnia-berlin.de/partys_party-detail.html?id=4051","tags":["Sexpositive","Erotic","Fetish","Techno","House"],"fromDate":"07.06"},{"title":"3 Jahre Hedomanie","fromTime":"22:00","description":"3 Jahre Hedomanie Two Floor Techno Play Party mit besonderen Performances, Dekoration und Awareness Team von ArtIDicction Collective  Techno, Hard Groove, Trance und House Musik von Cotumo (Ritter Butzke, Sisyphos) , Maniac Lina (Prisma), Wiebe Roose (ArtIDicction Resident) und DJ Kollektiv aus Belgien: Kompass Traxx! Couples Area, BDSM Dungeon und Playareas ab 22 Uhr geöffnet Dresscode: Fantasy, Fetisch, Sexy, Black Glamour, Kinky, Wild  Eintritt: 25€ an der Kasse<hr>HEDOMANIE: Glamour und Glitzer: Drei Jahre hedonistische Glückseligkeit!  Save the date und mach Dich bereit für eine unvergleichliche Nacht der Freude, in der wir die triumphale Reise unserer Hedomanie feiern, die nun in ihr viertes Jahr ihrer elektrisierenden Existenz geht!  2 Dancefloors mit Maniac Lina, Wiebe Roose, Cotumo, Kompass Traxx und vielen mehr Seit drei Jahren ist die Hedomanie das pulsierende Herz des hedonistischen Ausdrucks, wo die Beats die Sehnsüchte widerspiegeln und jeder Moment unter die Haut geht. Diese Jubiläumsausgabe verspricht ein extravagantes Fest, das die Grenzen unserer wildesten Fantasien überschreitet.  Was Du erwarten kannst:  RETROSPEKTIVE BEATS: Tauche ein in eine klangliche Reise durch die Beats, die unsere hedonistischen Eskapaden bestimmt haben. Unsere DJs, die Maestros hinter den Decks, werden einen Mix auflegen, der die Zeitachse unserer aufregenden dreijährigen Odyssee durchläuft.  Für diese Ausgabe: Cotumo (Sisyphos, Ritter Butzke) Kompass Traxx (Kompass Klub Belgien) Maniac Lina (Kit Kat Club, Klitball) Wiebe Roose (ArtIDicction)  TRIUMPHALE THEMEN: Erlebe die Magie vergangener Themen, die unsere Nächte mit Farbe und Energie gefüllt haben. Vom mystischen Wald bis zum ätherischen Himmel & Hölle, jede Ausgabe war ein Kapitel in unserer hedonistischen Geschichte. In dieser Nacht verschmelzen die Themen zu einer großen Feier der Vielfalt und Einheit.  LEBENDIGE KUNSTGALERIE: Erlebe die Verwandlung des Veranstaltungsortes in eine lebende Kunstgalerie, in der die visuellen Meisterwerke und Installationen gezeigt werden, die das Hedomanie über die Jahre hinweg geschmückt haben. Jedes Stück ist ein Zeugnis für die künstlerische Seele unseres Kollektivs.  BESONDERE AUFFÜHRUNGEN: Erlebe atemberaubende Performances, die die Grenzen der Kreativität erweitern. Von faszinierenden Tanzdarbietungen bis hin zu Live-Kunstinstallationen - unsere Jubiläumsausgabe ist eine Bühne für das Außergewöhnliche. Als Teil unseres wunderbaren ArtIDicction-Kollektivs, das sich immer wieder selbst erneuert, haben wir De Weirdo Mary eingeladen, bei dieser wilden Ausgabe aufzutreten! Erwarte etwas Ungewöhnliches!  ÜBERRASCHUNGEN ENTHÜLLEN: Mach Dich auf Überraschungen und Köstlichkeiten gefasst, die über die ganze Nacht verteilt sind. Von interaktiven Installationen bis hin zu exklusiven Giveaways - diese Feier ist unser Geschenk an die lebendige Gemeinschaft, die die Hedomanie zu dem gemacht hat, was sie heute ist.  INTERAKTIVE SPANKING-STATION: Unser Meister des Schmerzes wird Dich mit Vergnügen in die hohe Kunst des Empfangens und Verabreichens von sanfteren und härteren Berührungen einführen, ohne dass Du dabei deine Zustimmung geben musst!  Komm zu Peppe's pain booth! Feiere mit uns drei Jahre hedonistische Freude und die Kraft der Einheit im Hedonismus. Melde dich jetzt an und werde Teil dieser triumphalen Trilogie!","externalId":"4112","externalPicture":"https://www.insomnia-berlin.de/galpics/galleries/eventflyer/medium/0000085336.jpg","link":"https://www.insomnia-berlin.de/partys_party-detail.html?id=4112","tags":["Sexpositive","Erotic","Fetish","Techno","House"],"fromDate":"08.06"},{"title":"Swingin' Sunday","fromTime":"20:00","description":"Der frivol-fröhliche Wochenausklang für Paare & Singles! Open Bar, Whirlpool, Fuckable Beats Dresscode: Sexy und stilvoll - Eure Fantasie ist Euer einziger Kompass! All inclusive* Getränke Paare 75€ - Herren 75€ - Damen 25€ / Early Bird bis 21:00 Discount 10€ auf den Eintrittpreis für Paare & Frauen!<hr>Die Woche ist zu Ende, des montags ganze Härte steht ins Haus, die Batterien vom Vibrator sind auch leer und im Fernsehen ist wie immer nur – Tatort! Wie ungeil!  Also, entreiße Dich der häuslichen Lethargie, mach Dich schön und komme zu uns ins INSOMNIA! Es erwarten Dich spielfreudige, gierige Singles und erlebnishungrige Paare zu sexuellen Eskapaden, erotischen Abenteuern und umtriebigen Ausschweifungen.  Der neue Sonntagabend gibt Raum für lustvolle Möglichkeiten, Liebe & Triebe!   Ideal auch für Paare, die nach männlicher Verstärkung suchen.   Fuckable Sounds & Soft Beats   Bei uns herrscht Aktiver Konsens, d.h. erst fragen, dann anfassen. Wer swingen will, sollte freundlich und offen auf andere zugehen, ohne dabei penetrant zu sein. Wer SM Spielchen machen will, muss den richtigen Ton finden! Ein “Nein” ist ein “Nein” und wird auch nicht diskutiert!  *außer Champagner & Cocktails","externalId":"3863","externalPicture":"https://www.insomnia-berlin.de/galpics/galleries/eventflyer/medium/0000082894.jpg","link":"https://www.insomnia-berlin.de/partys_party-detail.html?id=3863","tags":["Sexpositive","Erotic","Fetish","Burlesque","Swinger","BDSM"],"fromDate":"09.06"},{"title":"International Sex Affairs","fromTime":"20:00","description":"Dresscode: Sexy und stilvoll - Eure Fantasie ist Euer einziger Kompass! Swinger Party & Fuckable Beats All inclusive* Getränke  Early Bird bis 21:00 Discount 10€ auf den Eintrittpreis für Paare & Frauen!<hr>Das Wunderbare am Dienstagabend sind die internationalen Begegnungen: fern der Heimat mitsamt ihrer Prüderie, der oftmals fehlenden heimischen Swingerclubkultur und des potenziellen Erwischt – Werdens durch unliebsame Nachbarn, reisen immer mehr abenteuerlustige Swinger aus aller Welt nach Berlin, um sich in der internationalen Sprache der Wollust zu verständigen und ihren sexuellen Horizont zu erweitern.  Während einer Geschäftsreise lässt sich immer mal eine „wichtige Besprechung“ abseits des offiziellen Programms machen, und so suchen sexhungrige Swingerpaare und Singles gerade unter der Woche ihren Spaß in der anonymen Großstadt.  Genieße einen versexten Abend mit spielfreudigen Nymphomaninnen, abenteuerlustigen Paaren und standhaften Herren in der lasziven Atmosphäre des INSOMNIA.  Open Bar, Whirlpool & Fuckable Beats  Wenn kubanischer Rhythmus mit israelischer Lebensfreude vögelt, sich norwegische Wikinger und australische Naturschönheiten vereinigen, asiatische Frühlingsrollen in italienische Calzone stoßen, die russische Zarin vom amerikanischen Deckhengst zugeritten wird und „mittenmang“ die erotische Berliner Szene kräftig mitmischt – dann haben wir International Sex Affairs - die erotische Globalisierung im Insomnia.  Bei uns herrscht Aktiver Konsens, d.h. erst fragen, dann anfassen. Wer swingen will, sollte freundlich und offen auf andere zugehen, ohne dabei penetrant zu sein. Wer SM Spielchen machen will, muss den richtigen Ton finden! Ein “Nein” ist ein “Nein” und wird auch nicht diskutiert!  Dies ist eine Sexparty und wir wünschen uns aktive Teilnehmer die sich in einvernehmlichen Situationen begegnen.  Wer sich erst einmal umsehen möchte, erste vorsichtige Schritte wagen will, empfehlen wir Freitag/Samstag mit erotischen Tanz - und Mottoparties.  *außer Champagner & Cocktails","externalId":"3811","externalPicture":"https://www.insomnia-berlin.de/galpics/galleries/eventflyer/medium/0000082802.jpg","link":"https://www.insomnia-berlin.de/partys_party-detail.html?id=3811","tags":["Sexpositive","Erotic","Fetish","Burlesque","Swinger","BDSM"],"fromDate":"11.06"},{"title":"Tango Vicioso","fromTime":"20:00","description":"Tango Argentino ausschweifend und lasterhaft  Immer am zweiten und vierten Mittwoch des Monats ab 20 Uhr bis ca. 2 Uhr Musik: Tango und NonTango, Tango Nuevo, Tango Fusion, Electrotango Specials: ab 20.30 Uhr kostenlose Tangoeinführung Dresscode: gerne elegant, Abendgarderobe, Fetisch, sexy,  Haut<hr>Ein alter Ballsaal aus der Gründerzeit dient als Bühne für ein sinnliches und außergewöhnliches Tangoerlebnis. Der argentinische Tango hat im Insomnia bereits seit Jahren Tradition. Hier treffen sich Tangotänzer und Nachtschwärmer um den Tango und die verführerische Atmosphäre zu genießen.  Eine Tangoeinführung ab 20:30 Uhr ist im Eintrittspreis inbegriffen..  Ab 21 Uhr startet die Tango-Bar mit einem abwechslungsreichen Mix aus alter und neuer Tangomusik mit Electrotango, Tango Nuevo, Tango Fusion und Nontangos.   Genießt den Abend mit allen Sinnen. Fühlt die Umarmung des Partners im Tanz, hört die Musik und für visuelle Eindrücke wird u.a. mit wechselnden Fotoprojektionen gesorgt.  Weitere Informationen unter <a target=\"_blank\" class=\"nodeco\" href=\"http://www.tangovicioso.de \">www.tangovicioso.de </a>","externalId":"3956","externalPicture":"https://www.insomnia-berlin.de/galpics/galleries/eventflyer/medium/0000083187.jpg","link":"https://www.insomnia-berlin.de/partys_party-detail.html?id=3956","tags":["Sexpositive","Erotic","Fetish","Tango"],"fromDate":"12.06"},{"title":"Berlin Kink","fromTime":"20:00","description":"Kinky Playparty Sexpositive playgrounds, BDSM Dungeon, Cinema Dresscode: Kinky – Elegant - Fetish  Eintritt 25€ / Early Bird Nachlass 10€ für Studierende, Paare und Damen bis 21:00<hr>Bereit für einen Abend voller prickelnder Abenteuer und sinnlicher Überraschungen?   Egal ob Neuling oder erfahrener Kinkster – Lady Kinky Amy oder Miss Vio, die Hosts of the Evening, heißen Dich herzlich willkommen und sorgen dafür, dass sich alle wohlfühlen und die Nacht in vollen Zügen genießen können.  Was Dich im exklusiven Basement von Insomnia erwartet: <b>Porn Cinema:</b> Erlebe Deine wildesten Fantasien hautnah <b>BDSM Playgrounds:</b> Entdecke neue Formen der Lust und Leidenschaft <b>Kerker:</b> Für spannende und aufregende Rollenspiele <b>Gyn Stuhl:</b> Für intime und aufregende Erlebnisse <b>Kreuz und Pranger:</b> Teste Deine Grenzen und finde neue Freuden <b>Duschen & Hygieneartikel:</b> Führ Deinen Komfort & Sicherheit  Dresscode: Kinky – Elegant - Fetish – Dessous – Lingerie – Kimono Lass Deiner Fantasie freien Lauf und zeig Dich von Deiner verführerischsten Seite!  Bei uns herrscht Aktiver Konsens, d.h. erst fragen, dann anfassen. Wer swingen will, sollte freundlich und offen auf andere zugehen ohne dabei penetrant zu sein. Wer SM Spiele machen will, muss den richtigen Ton finden! Ein “Nein” ist ein “Nein” und wird auch nicht diskutiert!","externalId":"4258","externalPicture":"https://www.insomnia-berlin.de/galpics/galleries/eventflyer/medium/0000085347.jpg","link":"https://www.insomnia-berlin.de/partys_party-detail.html?id=4258","tags":["Sexpositive","Erotic","Fetish","Swinger","BDSM"],"fromDate":"12.06"},{"title":"Lust Lab","fromTime":"20:00","description":"Ein erotischer Workshopabend mit anschließender Playparty Einlass nur von 20 bis 21 Uhr Anmeldung über: <a class=\"nodeco\" href=\"mailto:maximilian.bodywork@outlook.de\">maximilian.bodywork@outlook.de</a> Dresscode: im Workshopteil eher etwas Bequemes wie einen Morgenmantel, den Du schnell ausziehen kannst; im offenen Teil ist von nackt bis sexy Outfit alles erlaubt! Eintritt: All-Inclusive* Getränke (*Softdrinks, Wein, Bier) 49€ pro Person<hr>Specials am 13.6.: - Nach zwei wundervollen Lust Labs mit Fokus auf Massage wird im Juni ein Ritual aus dem Kamasutra im Zentrum stehen, bei dem wir unsere Körper mit verschiedenen Düften in ein sinnliches Bankett verwandeln und uns gegenseitig über den Geruchssinn erkunden. Aber auch der Tastsinn und Berührungen werden keinesfalls zu kurz kommen!  - Falls du zu den vergangenen Lust Labs keine Zeit hattest und hauptsächlich am Thema erotische Massage interessiert bist: Während der Playparty können wir gerne einen kleinen Miniworkshop dazu machen.  - Co-Host ist diesmal Stephanie Tack, die viele Jahre Erfahrung in Tanz und somatischer Arbeit mitbringt, ganz abgesehen von ihrem unglaublichen Charme, Verspieltheit und Feingefühl <a target=\"_blank\" class=\"nodeco\" href=\"https://stephanietack.com/\">stephanietack.com</a>  - Erstmals wird die Anmeldung nicht nur für Paare, sondern auch für Singles möglich sein. Allerdings wird auf ein ausgewogenes Verhältnis von Geschlechtern/Orientierungen geachtet, sodass es für alle ein guter Abend werden kann.   Als Paar darf man mit seinem Partner unter sich bleiben, aber sehr gern natürlich auch mit anderen in Kontakt kommen. Für die einzelnen Übungen/Spiele werden immer verschiedene Varianten angeboten, sodass du auch als Single die passende Ebene mit bisher fremden Menschen finden kannst.  - And we are bringing back the Ölgrube! Das Herumsauen mit viel Nurugel und vielen Menschen auf einem Haufen war letztes Mal so geil, dass wir das definitiv wiederholen!  Zur Partyreihe allgemein:  Im Laboratorium der Lust gehst Du Deiner Sinnlichkeit, Erotik und – wie sollte es anders sein – auch Deiner Lust nach.   Zu Beginn des Abends leitet Dich Maximilian mit achtsamen Methoden aus Sexological Bodywork, Massage und Tantra ins Hier und Jetzt, in Deinen Körper und die Begegnung mit Deinem erotischen Selbst.   Wenn die Sinne erst einmal aufgeweckt sind, kannst Du Dich auf eine Forschungsreise in tiefere Schichten Deiner Sexualität begeben, neue Facetten entdecken oder beinahe Vergessenes wieder in die Präsenz holen.   Danach geben Dir Partnerübungen den Raum für Begegnung, Verbundenheit und sexy Experimente mit einem anderen Genusswesen.  Die Energie, die sich bis dahin Schritt für Schritt immer weiter aufgebaut hat, darf sich dann in einer offenen Playparty hemmungslos entladen.   Dabei liegt die Betonung auf Play und Verspieltheit, dem lustvollen Flow in einer Gruppe Menschen, mit der Du Dich im Laufe des Workshopteils schon ein wenig vertraut machen konntest.   In diesem offenen Teil gibt es verschiedene Spielbereiche für Paare, Gruppen und diejenigen, die eine kleine Auszeit allein brauchen.  Über mich  Ich bin ausgebildeter Sexological Bodyworker (ISB Berlin) und Massagetherapeut und tauche zurzeit tiefer ins Thema Tantra(-massage) ein. In Einzelsitzungen begleite ich Menschen in sexualitätsbezogenen Prozessen der Heilung und des Wachstums.  <a target=\"_blank\" class=\"nodeco\" href=\"https://sexologicalbodywork.berlin/maximilian-gutberlet/\">https://sexologicalbodywork.berlin/maximilian-gutberlet/</a>","externalId":"4209","externalPicture":"https://www.insomnia-berlin.de/galpics/galleries/eventflyer/medium/0000084737.jpg","link":"https://www.insomnia-berlin.de/partys_party-detail.html?id=4209","tags":["Sexpositive","Erotic","Fetish","Burlesque","Swinger","BDSM"],"fromDate":"13.06"},{"title":"Curvy Love","fromTime":"20:00","description":"Aktive Swinger Party (nicht nur) für kurvige Ladys, Mollys & Rubensliebhaber – für Paare, Trios & Singles! Open Bar & Whirlpool Dresscode: Sexy – Dessous – Verführerisch All inclusive Getränke:  Paare 75€ - Herren 75€ - Damen 25€ Early Bird bis 21:00 Discount €10 auf den Eintrittpreis für Paare & Frauen!<hr>Tauch ein in die faszinierende Welt von \"Curvy Love\"! Unsere Swinger Party zelebriert sinnliche Rundungen in ihrer ganzen Pracht – von üppig bis gewaltig, von drall bis voluminös. Ein Fest der Weiblichkeit, das Rubensliebhaber und alle, die das Leben in vollen Zügen genießen, vereint.   Erlebe eine Nacht voller sündiger Verlockung und Leidenschaft in unserer sicheren, sauberen sexuellen Eskapaden Infrastruktur für abenteuerlustige Singles und umtriebige Paare. Finde Gleichgesinnte für erotische, verruchte Spiele zu zweit, zu dritt oder mit vielen.   Fühle Dich frei die Magie Deiner Kurven zu versprühen! Dies ist eine Sex Party und wir wünschen uns aktive Teilnehmer die sich in einvernehmlichen Situationen begegnen. Wer sich erst einmal umsehen möchten, erste vorsichtige Schritte wagen will, empfehlen wir Freitag/Samstag mit erotischen Tanz - und Mottopartys.  Bei uns herrscht Aktiver Konsens, d.h. erst fragen, dann anfassen. Wer swingen will, sollte freundlich und offen auf andere zugehen ohne dabei penetrant zu sein. Wer SM Spielchen machen will, muss den richtigen Ton finden! Ein “Nein” ist ein “Nein” und wird auch nicht diskutiert!  *außer Champagner & Cocktails","externalId":"4000","externalPicture":"https://www.insomnia-berlin.de/galpics/galleries/eventflyer/medium/0000083267.jpg","link":"https://www.insomnia-berlin.de/partys_party-detail.html?id=4000","tags":["Sexpositive","Erotic","Fetish","Burlesque","Swinger","BDSM"],"fromDate":"13.06"},{"title":"Flashback Friday - The 90's-00's Party","fromTime":"22:00","description":"Special Combi Ticket with KINKTASTISCH! 15.06 - 2 parties for only 35€  <a target=\"_blank\" class=\"nodeco\" href=\" https://allevents.in/berlin/kinktastisch-celebrate-kink-techno-and-play/80002088038333\">https://allevents.in/berlin/kinktastisch-celebrate-kink-techno-and-play/80002088038333</a><hr>Sex-positive 90er Party 90s Sounds und Beats auf 2 Dancefloors Be Yourself - All Genders & Orientations Welcome Dresscode: 90s - Fetisch - Sexy<hr>Willkommen zur heißesten Kinky Throwback Party in Berlin!   Erlebe mit uns eine Nacht voller Nostalgie, Freiheit und Selbstverwirklichung auf unserer Kinky Party, bei der wir die Zeit in die glorreiche Ära der 90er und 00er Jahre zurückdrehen. Mach Dich bereit zu tanzen, als ob niemand zuschaut, denn wir bringen Dir nicht nur eine, sondern gleich ZWEI Tanzflächen mit Nonstop-Beats.  Main Floor: Spice up your life! Bewege Dich zu den unvergesslichen Pop-Hits, Euro-Trash und pulsierenden House-Beats, die eine ganze Ära geprägt haben. Diese Tanzfläche ist der Ort, an dem die Magie passiert, und wir wollen sehen, wie Du sie eroberst!  Second Floor: Rock Your Body Right! Für alle, die sich nach der rohen Energie von Rock, Metal, Grunge und Indie sehnen, ist unsere zweite Tanzfläche genau das Richtige. Lass los, headbang und genieße den rebellischen Geist der 90er und 00er Jahre.  Sei Du selbst - Alle Geschlechter und Orientierungen sind willkommen Egal, wer Du bist oder wen Du liebst, Du bist hier willkommen. Umarme Dein wahres Ich und feiere mit einer Gemeinschaft, die jeden Einzelnen schätzt und fördert.  Einverständnis ist sexy - Nein heißt Nein! Respekt ist unsere goldene Regel. Vergiss nicht, dass Einverständnis nicht nur wichtig ist, sondern geradezu sexy! Nein heißt Nein! Und wir sind dafür da, dass sich jeder sicher und respektiert fühlt. Wenn Du die Dinge auf der Tanzfläche oder darüber hinaus auf die Spitze treiben willst, denk daran, zuerst zu fragen. Das Einverständnis einzuholen ist der Schlüssel für eine einvernehmliche Party und eine unvergessliche Nacht!  Unicorn Awareness Team Unser Unicorn Awareness Team ist für Dich da! Wenn Du Hilfe brauchst, Fragen hast oder einfach nur mit jemandem plaudern möchtest, halte Ausschau nach unseren freundlichen Teammitgliedern - sie sind in Regenbogenfarben gekleidet und bereit, Dir zu helfen.  Willkommensshots, Süßigkeiten, Spielbereiche und Whirlpool-Spaß Beginne die Nacht mit Begrüßungsshots am Eingang, genieße die Süßigkeiten, erkunde die Spielbereiche für Erwachsene und tauche ein in den aufregenden Whirlpool. Deine Nacht wird garantiert ein aufregendes Abenteuer und ein unvergessliches Fest!  Dress to Impress: Farbenfroh, 90er- bis 00er-Jahre-Ikonen, Fetisch, pervers, sexy, Neon  Zieh deine gewagtesten und schillerndsten Outfits an, inspiriert von der pulsierenden 90er- bis 00er-Jahre-Ära. Denke farbenfroh, spiele mit deinen Lieblingssymbolen, zeige Dich pervers und sexy oder leuchte in Neon! Deine Garderobe kann so gewagt sein wie Deine Tanzschritte.  Halte den Moment fest! Wenn du deine Erinnerungen an diesen Abend festhalten möchtest, steht dir unser Fotograf zur Verfügung, den Du bitten kannst, ein Foto von Dir zu machen. Der Fotograf wird nur Fotos machen, wenn Du Dein Einverständnis gegeben hast; ohne dein Einverständnis werden keine Fotos gemacht.  Reguläres Ticket: 23€ Studenten (mit Ausweis) / Sozialticket: 18€  Mach Dich bereit für eine Nacht der Befreiung, der Selbstdarstellung und des puren, unverfälschten Spaßes. Der Flashback Friday ist der 'place to be'! Wir können es kaum erwarten, mit Dir zu feiern!","externalId":"4072","externalPicture":"https://www.insomnia-berlin.de/galpics/galleries/eventflyer/medium/0000084748.jpg","link":"https://www.insomnia-berlin.de/partys_party-detail.html?id=4072","tags":["Sexpositive","Erotic","Fetish","90s","00s"],"fromDate":"14.06"},{"title":"KINKTASTISCH! Celebrate all Kinks!","fromTime":"22:00","description":"Special Combi Ticket with Flashback Friday 14.06 - 2 parties for only 35€  <a target=\"_blank\" class=\"nodeco\" href=\" https://allevents.in/berlin/kinktastisch-celebrate-kink-techno-and-play/80002088038333\">https://allevents.in/berlin/kinktastisch-celebrate-kink-techno-and-play/80002088038333</a><hr>Kinky Dance & Playparty Techno - House - Electro - Classics by DJs Epicx & Lale Midnight show & Try out kinky corners BDSM Basement & Dungeon Dresscode: Fetish - Goth - Uniform - Elegante Abendgarderobe Sonderpreis für Studenten: 20€<hr>Komm und sei ganz Du selbst! Alle Fetische, alle Geschlechter, Nicht-Geschlechter und alle Ausrichtungen sind willkommen!  Wenn Du unseren Partybereich betrittst, wird Dich ein freundliches Einhorn begrüßen und Dich mit einem süßen Willkommensschuss willkommen heißen, damit Du den besten Start in diesen Abend hast. Berliner Underground DJs spielen treibende Beats und fesseln Dich auf der Tanzfläche. Um Mitternacht präsentieren großartige Performer ihre Kunst. Fühle Dich frei zu tanzen, zu feiern und unsere vielfältigen Spielräume zu entdecken!  * Unsere Einhörner werden herumlaufen und dafür sorgen, dass sich jeder wohl und sicher fühlt, Sie sind für Dich da, also sprich sie ruhig an und frag sie nach allem.  * Unser wunderbarer Fotograf Tobias Ahlbrecht <a target=\"_blank\" class=\"nodeco\" href=\"https://www.instagram.com/tobiasahlbrecht/\">https://www.instagram.com/tobiasahlbrecht/</a>  wird dafür sorgen, dass Du etwas hast, das Dich an diesen Abend erinnert.  \"Kinktastisch\" ist eine Fetisch- und Sex-Positive Party, bei der Zustimmung der Schlüssel ist!   Um das zu gewährleisten, solltest Du unsere Regeln sorgfältig lesen und befolgen: * Nein heißt Nein. * Willst Du mit jemandem reden, tanzen oder spielen? Frag ihn höflich, ob er interessiert ist und respektiere seine Antwort. * Lass anderen ihren Freiraum, wenn sie miteinander spielen oder intim sind. Willst Du mitmachen? Frag höflich nach und respektiere ihre Antwort. * Handys sind nicht erlaubt! Lass sie in der Garderobe. * Kein Zutritt in Jeans oder Straßenkleidung, wir haben einen Dresscode, um die perverse Atmosphäre zu erhalten. * Das Überschreiten von Grenzen wird nicht toleriert, frag einmal, ein Nein ist ein Nein. * Sexuelle Belästigung wird nicht geduldet. * Verbale Belästigung wird nicht geduldet. * Nein heißt Nein. ____________________________  Empfohlene Kleiderordnung: Latex, Vinyl, PVC, perverse Uniformen, perverse Kostüme, Cyber Erotic & Sci-Fi, Little, Kinky Drag, sexy Dessous, Crossdress, Körperbemalung, Cabaret, Fetish Goth, Medical, Tiere, Burlesque, Fetish Formal, Welpe, Pony, Rüstung, Cosplay, Superhelden...  Hast Du eine Frage? Frag einfach :) ____________________________  +++Das Management, die Veranstalter und ihre Vertreter haben das Recht, den Einlass ohne Angabe von Gründen zu verweigern.+++","externalId":"4169","externalPicture":"https://www.insomnia-berlin.de/galpics/galleries/eventflyer/medium/0000085395.jpg","link":"https://www.insomnia-berlin.de/partys_party-detail.html?id=4169","fromDate":"15.06"},{"title":"Swingin' Sunday","fromTime":"20:00","description":"Der frivol-fröhliche Wochenausklang für Paare & Singles! Open Bar, Whirlpool, Fuckable Beats Dresscode: Sexy und stilvoll - Eure Fantasie ist Euer einziger Kompass! All inclusive* Getränke Paare 75€ - Herren 75€ - Damen 25€ / Early Bird bis 21:00 Discount 10€ auf den Eintrittpreis für Paare & Frauen!<hr>Die Woche ist zu Ende, des montags ganze Härte steht ins Haus, die Batterien vom Vibrator sind auch leer und im Fernsehen ist wie immer nur – Tatort! Wie ungeil!  Also, entreiße Dich der häuslichen Lethargie, mach Dich schön und komme zu uns ins INSOMNIA! Es erwarten Dich spielfreudige, gierige Singles und erlebnishungrige Paare zu sexuellen Eskapaden, erotischen Abenteuern und umtriebigen Ausschweifungen.  Der neue Sonntagabend gibt Raum für lustvolle Möglichkeiten, Liebe & Triebe!   Ideal auch für Paare, die nach männlicher Verstärkung suchen.   Fuckable Sounds & Soft Beats   Bei uns herrscht Aktiver Konsens, d.h. erst fragen, dann anfassen. Wer swingen will, sollte freundlich und offen auf andere zugehen, ohne dabei penetrant zu sein. Wer SM Spielchen machen will, muss den richtigen Ton finden! Ein “Nein” ist ein “Nein” und wird auch nicht diskutiert!  *außer Champagner & Cocktails","externalId":"3864","externalPicture":"https://www.insomnia-berlin.de/galpics/galleries/eventflyer/medium/0000082895.jpg","link":"https://www.insomnia-berlin.de/partys_party-detail.html?id=3864","tags":["Sexpositive","Erotic","Fetish","Burlesque","Swinger","BDSM"],"fromDate":"16.06"},{"title":"International Sex Affairs","fromTime":"20:00","description":"Dresscode: Sexy und stilvoll - Eure Fantasie ist Euer einziger Kompass! Swinger Party & Fuckable Beats All inclusive* Getränke  Early Bird bis 21:00 Discount 10€ auf den Eintrittpreis für Paare & Frauen!<hr>Das Wunderbare am Dienstagabend sind die internationalen Begegnungen: fern der Heimat mitsamt ihrer Prüderie, der oftmals fehlenden heimischen Swingerclubkultur und des potenziellen Erwischt – Werdens durch unliebsame Nachbarn, reisen immer mehr abenteuerlustige Swinger aus aller Welt nach Berlin, um sich in der internationalen Sprache der Wollust zu verständigen und ihren sexuellen Horizont zu erweitern.  Während einer Geschäftsreise lässt sich immer mal eine „wichtige Besprechung“ abseits des offiziellen Programms machen, und so suchen sexhungrige Swingerpaare und Singles gerade unter der Woche ihren Spaß in der anonymen Großstadt.  Genieße einen versexten Abend mit spielfreudigen Nymphomaninnen, abenteuerlustigen Paaren und standhaften Herren in der lasziven Atmosphäre des INSOMNIA.  Open Bar, Whirlpool & Fuckable Beats  Wenn kubanischer Rhythmus mit israelischer Lebensfreude vögelt, sich norwegische Wikinger und australische Naturschönheiten vereinigen, asiatische Frühlingsrollen in italienische Calzone stoßen, die russische Zarin vom amerikanischen Deckhengst zugeritten wird und „mittenmang“ die erotische Berliner Szene kräftig mitmischt – dann haben wir International Sex Affairs - die erotische Globalisierung im Insomnia.  Bei uns herrscht Aktiver Konsens, d.h. erst fragen, dann anfassen. Wer swingen will, sollte freundlich und offen auf andere zugehen, ohne dabei penetrant zu sein. Wer SM Spielchen machen will, muss den richtigen Ton finden! Ein “Nein” ist ein “Nein” und wird auch nicht diskutiert!  Dies ist eine Sexparty und wir wünschen uns aktive Teilnehmer die sich in einvernehmlichen Situationen begegnen.  Wer sich erst einmal umsehen möchte, erste vorsichtige Schritte wagen will, empfehlen wir Freitag/Samstag mit erotischen Tanz - und Mottoparties.  *außer Champagner & Cocktails","externalId":"3812","externalPicture":"https://www.insomnia-berlin.de/galpics/galleries/eventflyer/medium/0000082803.jpg","link":"https://www.insomnia-berlin.de/partys_party-detail.html?id=3812","tags":["Sexpositive","Erotic","Fetish","Burlesque","Swinger","BDSM"],"fromDate":"18.06"}]