[{"datum":"01.Jun","fromTime":"23h","title":"CarneBall Bizarre-KitKatClubnacht","description":"Monty, Jam El Mar, Don Tom, Chaos Techno Berlin und Cabaret Sultana. Bereits ab 20 Uhr im Basement: Stolz und Demut. Ab ca. 1 Uhr: Disco Bizarre im 4. Raum, im Basement: My Secret Playground, Florian Loveshack und D.J. himself. Salon Rouge (ab ca. 2 Uhr), im 5. Raum, im Basement: DJ FoxMind. Prisma Floor: Rochelle Baz, Distelfink und Cheesebeat. Sauna, Outdoorarea, Playspace, Candy-Shop, etcetera .... :-) Kinky, Fetish, Gothik, Lack &amp; Leder, Kostüme, Glitzer &amp; Glamour, elegante Abendgarderobe, Außergewöhnliches jeder Art. Bunte Outfits werden bevorzugt! KEINE normale Straßenkleidung. Jeans &amp; Sportschuhe sind verboten! Normale Unterhosen auch. Wir sind kein Swingerclub. Anfassen, ohne das Einverständnis des Gegenübers, oder beim Vorübergehen, führt zu Hausverbot. Lebenslänglich."},{"datum":"02.Jun","fromTime":"08h","title":"Nachspiel-Afterhour: Carpe Diem!","description":"Match Hoffman, Daora Techno, Electro \"The most famous Sunday Afterhour at KitKatClub. Sex-positive and queer-friendly Party Edition - kinky style! Hot or freaky, nerdy or beardy: everyone is welcome! Follow the rhythm of electronic music and be feel happy the way you are.\" Huge chill out areas, Swimming pool. Dress to impress! No street wear - no Jeans &amp; no T-Shirts."},{"datum":"02.Jun","fromTime":"22h","title":"Somnambul BLN","description":"Max Muth, Mila Dietrich, Tom Cordes Techno, Electro TheSundayNightElectronicDanceExperience@KitKatClub! \"On Sunday from 10 p.m., the Somnambul BLN celebrates, loves and dances without a strict dress code, but all the more freely. (...) Everything else is as usual at the KitKat: anything might happen - everything is possible - and nothing is obligatory.\" Outdoor pool area is open. No strict Dresscode … be yourself!"},{"description":""},{"datum":"03.Jun","fromTime":"19h","title":"Tango Rouge Sensual Monday with Bachata &amp; Kizomba","description":"DJ Dilara Ogretmen, DJ Hach Entry from 18:45/Einlass ab 18 Uhr 45. 19:00 classes in Tango, Bachata &amp; Kizomba. Tango Introduction with Pedram Shahyar, Close Embrace with Malachai Payne, Tango Technique and Musicality with Leandro Furlan. Bachata open level with Kyana &amp; Emin. Kizomba open level with Sara &amp; Pam. No experience and no partner needed! 21:00 Party on 2 floors.<br><br>Our venue, Berlin's legendary KitKatClub, is a sex positive space where everyone can (doesn't have to) explore and express their sexuality without judgement and shame. Needless to say: Consent is always key. No dress code on Monday - but you are very welcome to dress to impress!"},{"datum":"03.Jun","fromTime":"22h","title":"Electric Monday","description":"Annina &amp; Scoopsi, Andre Lodemann, Berkita, Frankie Flowerz, Ricardo Rodriguez Techno, House \"Enjoy the Vibe &amp; Get Freaky. Bring &amp; Share Love as Usual!\" Come As You Are and do Dress n Express yourself, KitKat style - colourful, fancy, wild, different, kinky, smart - most of all be authentic."},{"datum":"04.Jun","fromTime":"22h","title":"Illusion","description":"Serioes &amp; Legendaer b2b Little Duracell (live), Frankov Techno \"Step into an enchanting realm where the ordinary gives way to the extraordinary at Illusion. (...) Let go of inhibitions as you immerse yourself in the pulsing energy that fills the air.\" Kinky, playful, extravagant, latex, leather, mesh, costumes - be creative and brave. No streetwear!"},{"datum":"05.Jun","fromTime":"22h","title":"Symbiotikka","description":"Jose Bonetto, Jordan, Vom Feisten, Zagroza Techno \"Expand your horizon and have a look over the edge. Celebrate with us Respect, Freedom, Love and Music!\" Kinky Shows live, Bondage Show live, Playspace, Bodypainting, Pool and some special surprises... Be particular, creative, sexy, wicked, kinky, especially or crazy. But never boring!"},{"datum":"06.Jun","fromTime":"19h","title":"Vernissage: CLIMAX and VULNERABILITY by Marcello Castellani","description":"„Climax and Vulnerability by Marcello Castellani invites the viewer on an intimate journey through body self-portraits and the representation of ecstasy. With eight small-format works and two large-format pieces, the artist explores their nudity and sensuality for the first time, challenging their comfort zone.“ Vernissage/Exhibition will take place in Salon Rouge in the basement of KitKatClub. Live &amp; Dj set by Soviet Gym. Free entry, donations based. Entrance via Ohmstrasse 11, follow the red lights. More informations about the exhibition and the artist:<br><br>https://www.facebook.com/events/1498262671043872 No dress code."},{"datum":"06.Jun","fromTime":"22h","title":"Human Colours X Hexenwerk Festival","description":"Je Saré, Macho Milano, Der Eggert, Modulatos, Christoph Kuhlmann, Somaphon, Milk`N Coffee, Schnabeln &amp; Saugen Techno, Tech House „We bring Techno, Burlesque and Body Art every first Thursday at KitKatClub! (...) The universe is full of colors and sounds that vibrate together.“ Kinky Body Painting by Thaly White – LightgoesDark. Secret Burlesque Performance by Maria Mané. This time we have two selected dancers for you to enchant your senses. Attention, we are the original KitKat party this evening, LEFT ENTRANCE! There is another external event in the upper area of the club. More informations and pre-sale tickets:<br><br>https://de.ra.co/events/1821597"},{"datum":"07.Jun","fromTime":"22h","title":"Four Play 8th Anniversary","description":"Any Mello, Camea, Hang Aoki, Jon Hester, Lina, N.E.O., Niemand &amp; Keiner, Wanda Wild, Mømentum, Mi-Ka, Philipp Gorbachev, Thor Rixon, The Naked Tea Party. Salon Rouge: 5 String Theory (live concert), Kraut Pleasure Techno, House „8 YEARS FOUR PLAY! 8 years of making our scene lighter, more colorful, and happier. (…) 8 years, and we have only just started!“ 5 Floors, Basement area open. Performer Program: artEmiss Collective, Burlesque Show by Eros, Dream Circus Pirates, Dream Worlds: Scissortopia, Evilyn Frantic, Maia Friend. Stations and Activities: Erotic Tarot Reading, Kinky Booth, Pokemon Center Massage Clinic, Sexify Happenings, Sketch Artists, The Naked Tea Party. The CODE Kindergarten: Frau Dark, The Naughty Ballosint, The Naughty Clown, The Naughty Educator, The Naughty Nanny. Kinky Market Place by GammaWear, IMPOPSIBILE, Shimmies. More informations:<br><br>https://de.ra.co/events/1832696 Sexy swimsuits, costumes, leather, latex, naked, super heroes, lingerie, colorful festival style. No casual street wear such as jeans is allowed!"},{"datum":"08.Jun","fromTime":"19h","title":"Tango Rouge at CarneBall Bizarre","description":"19:00 Entrance Buffet. 19:30 Classes in Argentine Tango: No experience and no partner needed – come alone, as a couple or bring some friends! 2 Classes, Beginners Class: Introduction to Tango. Dramatic &amp; playful figures. 21:00 Tango Party in Salon Rouge. Live music and Performances all night long. Entry from 19:00/Einlass ab 19:00 Uhr, you need to be there before 21:00. The entry is valid for the whole Saturday night in all areas of KitKatClub. Playful, kinky, fetish, carnival, crazy, sexy, extremely elegant Tango. Casual dress = no entry!"},{"datum":"08.Jun","fromTime":"23h","title":"CarneBall Bizarre-KitKatClubnacht","description":"Hardy Hard, Felix FX, Travis, Marc Lange und Lokomotive. Disco Bizarre im 4. Raum, im Basement: Chris Gavin, Early Grey und Billy Idle. Salon Rouge (ab 1 Uhr 30), im 5. Raum, im Basement: DJ Dad of the year (slowtempo) + sensual duo dance performance around 01:30am (Towadei). Prisma Floor: DJ Hach (Bachata 19-24 Uhr), The Shredder, ubersaat. Sauna, Outdoorarea, Playspace, Candy-Shop, etcetera .... :-) Kinky, Fetish, Gothik, Lack &amp; Leder, Kostüme, Glitzer &amp; Glamour, elegante Abendgarderobe, Außergewöhnliches jeder Art. Bunte Outfits werden bevorzugt! KEINE normale Straßenkleidung. Jeans &amp; Sportschuhe sind verboten! Normale Unterhosen auch. Wir sind kein Swingerclub. Anfassen, ohne das Einverständnis des Gegenübers, oder beim Vorübergehen, führt zu Hausverbot. Lebenslänglich."},{"datum":"09.Jun","fromTime":"08h","title":"Nachspiel-Afterhour: Carpe Diem!","description":"Marcel db/B-Day, DJ Funk@delic, Gizmo Techno, Electro \"The most famous Sunday Afterhour at KitKat Club. Sex-positive and queer-friendly Party Edition - kinky style! Hot or freaky, nerdy or beardy: everyone is welcome! Follow the rhythm of electronic music and be feel happy the way you are.\" Huge chill out areas, Swimming pool. Dress to impress! No street wear - no Jeans &amp; no T-Shirts."},{"datum":"09.Jun","fromTime":"10h","title":"Breakfast Club + Classical Sundays","description":"Classical Concert (from 14.00) It’s that time again! The Breakfast Club kicking off our Summer Edition, starting earlier, chilling harder with Classical Sundays interventions again. :-) This Sunday 09/06 we host a special classical concert, last time at KitKat until the fall! We open already 9:15! Brunch starts at 11.00, concert at 14.00. Tickets at the door, 5 € min donation at the door for the program! Extra donations box for Breakfast buffet inside. Entrance via Ohmstrasse 11, follow the signs… Bring your cozy clothes n house shoes (we got you if not), come in a state of contenance, no dress code required. Comfy. :-)"},{"datum":"09.Jun","fromTime":"22h","title":"Somnambul BLN","description":"(Gallya)→Erebos, Spicy Flamingo, Vlad Yaki Techno, Electro TheSundayNightElectronicDanceExperience@KitKatClub! \"On Sunday from 10 p.m., the Somnambul BLN celebrates, loves and dances without a strict dress code, but all the more freely. (...) Everything else is as usual at the KitKat: anything might happen - everything is possible - and nothing is obligatory.\" Outdoor pool area is open. No strict Dresscode … be yourself!"},{"description":""},{"datum":"10.Jun","fromTime":"19h","title":"Tango Rouge Sensual Monday with Bachata &amp; Kizomba","description":"DJ Dilara Ogretmen, DJ Francesco Entry from 18:45/Einlass ab 18 Uhr 45. 19:00 classes in Tango, Bachata &amp; Kizomba. Tango Introduction with Vanessa, Close Embrace with Dilara Ogretmen &amp; Malachai Payne, Tango Technique and Musicality with Francesco Cieschi. Bachata open level with Leonie &amp; Miki. Kizomba open level with Sara &amp; Pam. No experience and no partner needed! 21:00 Party on 2 floors.<br><br>Our venue, Berlin's legendary KitKatClub, is a sex positive space where everyone can (doesn't have to) explore and express their sexuality without judgement and shame. Needless to say: Consent is always key. No dress code on Monday - but you are very welcome to dress to impress!"},{"datum":"10.Jun","fromTime":"22h","title":"Electric Monday","description":"Justin Massei, Hi Hat Dancer, Soltight, Ricardo Rodriguez, Frankie Flowerz Techno, House \"Enjoy the Vibe &amp; Get Freaky. Bring &amp; Share Love as Usual!\" Come As You Are and do Dress n Express yourself, KitKat style - colourful, fancy, wild, different, kinky, smart - most of all be authentic."},{"datum":"11.Jun","fromTime":"19h","title":"Erotic Life Drawing","description":"Erotic Life Drawing (Aktzeichnen) in Salon Rouge Floor (Raum 5) in the Basement of KitKatClub, featuring Sex Workers models. Next session Tuesday 11th of June, from 7pm til 10pm or later! Bring your own materials: „Get ready for a sexy evening of erotic art to welcome our summer pausa! (…) These sessions seeks to explore the deep relationship between art and er/o/tism.“ DJ special guest @dotdash_eisheth coum. Separate entrance through the backyard via Ohmstrasse 11, follow the signs &amp; the red lanterns! Entrance fee by donations, recommended 10-20 Euro. More informations (auch in deutscher Sprache):<br><br>https://www.facebook.com/events/1613399692773299 No dress code."},{"datum":"11.Jun","fromTime":"22h","title":"Illusion","description":"Kaan Deniz Ertürk, Fræd b2b Zeitfrei Techno \"Step into an enchanting realm where the ordinary gives way to the extraordinary at Illusion. (...) Let go of inhibitions as you immerse yourself in the pulsing energy that fills the air.\" Kinky, playful, extravagant, latex, leather, mesh, costumes - be creative and brave. No streetwear!"},{"datum":"12.Jun","fromTime":"22h","title":"Symbiotikka – Chris B-Day Special","description":"Mija, Lovra, Jordan, Anubix Techno \"Expand your horizon and have a look over the edge. Celebrate with us Respect, Freedom, Love and Music!\" Kinky Shows live, Bondage Show live, Playspace, Bodypainting, Pool and some special surprises... Be particular, creative, sexy, wicked, kinky, especially or crazy. But never boring!"},{"datum":"13.Jun","fromTime":"22h","title":"Psycho Benecke","description":"Mark Benecke, Coon, Ari, Match Hoffman, Johnson Patrick Techno, Psytrance \"Where Psy meets Techno. In the basement of KitKatClub.“ Performance, Play Area, Photos. Welcomes: LGBTQ, Body positivity, Inked. Pre-sale tickets:<br><br>https://de.ra.co/events/1931167"},{"datum":"14.Jun","fromTime":"22h","title":"Revolver Party","description":"Moussa, Hendrik Milan, Federico Maniscalco, Tiefton, Oliver M, Jaycap, 2Faro, Kitty Vader Revolver is the monthly gay party event in KitKatClub. “Our events are safe spaces for queer and trans men and are THEREFORE strictly men only!“ Buy your tickets: <br><br>https://revolverparty.com/tickets Fetish clothing, jockstraps, mesh shirts, sporty outfits. The more creative, the better!"},{"datum":"15.Jun","fromTime":"19h","title":"Tango Rouge at CarneBall Bizarre","description":"19:00 Entrance Buffet. 19:30 Classes in Argentine Tango: No experience and no partner needed – come alone, as a couple or bring some friends! Warm up &amp; Beginners with Pedram Shahyar &amp; Thekla. Drama &amp; playful figures with Julian Elizari Romeo. 21:00 Milonga &amp; Party. Shows and performances through the night. Live music by Federico Aguirre &amp; Damian DAlessandro. Entrance 19:00 - 21:00, strict dresscode! Classes start in time so please come early. The entry is valid for the whole Saturday night in all areas of KitKatClub. Playful, kinky, fetish, carnival, crazy, sexy, extremely elegant Tango. Casual dress = no entry!"},{"datum":"15.Jun","fromTime":"20h","title":"CarneBall Bizarre-KitKatClubnacht","description":"Opening ab heute schon um 20 Uhr (!), siehe unten unter „Special“, Decks ab 22 Uhr: Puk, Clark Kent, Jam El Mar und Sudo. Slow Grind Bizarre: Rosa Lee und Snap Gap. Disco Bizarre im 4. Raum, im Basement: Der Würfler, Giacomo Virzi und Billy Idle. Salon Rouge (ab 2 Uhr), im 5. Raum, im Basement: The Shredder. Prisma Floor: Paratelic, Cheesebeat und Maximum Disaster. NEW: Every Saturday The „Come Together“-Preparty @ 8 P.M.<br><br>Liebe Gäste &amp; Freunde der Nacht!<br>Ab diesem SAMSTAG öffnen wir unsere Türen am Wochenende bereits um 20 Uhr! Von 20 bis 22 Uhr wollen wir leicht &amp; locker in den Abend einsteigen: Freunde treffen, chillen am Pool, Zeit zu plaudern und für ausführliche Gespräche. Eine Bar- und Strandatmosphäre schwebt uns vor: Ein „Come Together“ vor der Party!<br><br>Als angenehmen Nebeneffekt erhoffen wir, dass sich die ankommenden Gäste besser über die Nacht verteilen und sich dadurch die unsäglichen Wartezeiten in der Schlange elementar verkürzen. Oder im besten Fall erst gar keine Schlange entsteht. Wäre das nicht wunderbar?<br><br>Aus aktuellem Anlass möchten wir euch auch alle bitten, immer daran zu denken, dass es Nachbarn gibt, die Nachts ihre Ruhe wollen. Einige Beschwerden liegen vor, deshalb haben uns die zuständigen Ämter kontaktiert. Wir müssen außerhalb des Clubs definitiv leiser werden, bitte helft uns dabei! Knebel möchten wir ungern verteilen. :-)<br><br>Der Dresscode gilt selbstverständlich ab 20 Uhr, ebenso ist der normale Obolus zu entrichten. <br><br>Let`s dance &amp; play on!<br>Eure KitKat-Crew<br><br>Sauna, Outdoorarea, Playspace, Candy-Shop etcetera .... :-) Kinky, Fetish, Gothik, Lack &amp; Leder, Kostüme, Glitzer &amp; Glamour, elegante Abendgarderobe, Außergewöhnliches jeder Art. Bunte Outfits werden bevorzugt! KEINE normale Straßenkleidung. Jeans &amp; Sportschuhe sind verboten! Normale Unterhosen auch. Wir sind kein Swingerclub. Anfassen, ohne das Einverständnis des Gegenübers, oder beim Vorübergehen, führt zu Hausverbot. Lebenslänglich."},{"datum":"16.Jun","fromTime":"08h","title":"Nachspiel-Afterhour: Carpe Diem!","description":"Anne Decks, Miss Sunshine Techno, Electro \"The most famous Sunday Afterhour at KitKat Club. Sex-positive and queer-friendly Party Edition - kinky style! Hot or freaky, nerdy or beardy: everyone is welcome! Follow the rhythm of electronic music and be feel happy the way you are.\" Huge chill out areas, Swimming pool. Dress to impress! No street wear - no Jeans &amp; no T-Shirts."},{"datum":"16.Jun","fromTime":"22h","title":"Somnambul BLN","description":"Badwolf, Boho, Prost! Techno, Electro TheSundayNightElectronicDanceExperience@KitKatClub! \"On Sunday from 10 p.m., the Somnambul BLN celebrates, loves and dances without a strict dress code, but all the more freely. (...) Everything else is as usual at the KitKat: anything might happen - everything is possible - and nothing is obligatory.\" Outdoor pool area is open. No strict Dresscode … be yourself!"},{"description":""},{"datum":"17.Jun","fromTime":"19h","title":"Tango Rouge Sensual Monday with Bachata &amp; Kizomba","description":"DJ Francesco, DJ Hach Entry from 18:45/Einlass ab 18 Uhr 45. 19:00 classes in Tango, Bachata &amp; Kizomba. Tango Introduction with Pedram Shahyar, Close Embrace with Malachai Payne, Tango Technique and Musicality with Francesco Cieschi. Bachata open level with Anne &amp; Toni. Kizomba open level with Sara &amp; Pam. No experience and no partner needed! 21:00 Party on 2 floors.<br><br>Our venue, Berlin's legendary KitKatClub, is a sex positive space where everyone can (doesn't have to) explore and express their sexuality without judgement and shame. Needless to say: Consent is always key. No dress code on Monday - but you are very welcome to dress to impress!"},{"datum":"17.Jun","fromTime":"22h","title":"Electric Monday","description":"Nils Ohrmann, BB Deng, Frankie Flowerz, Ricardo Rodriguez Techno, House \"Enjoy the Vibe! Bring &amp; Share Love as Usual!\" We have a relaxed Dresscode so, Come As You Are, however it is still the KitKatClub, so do Dress n Express yourself - casual or colourful, fancy, different, smart - most of all be authentic."},{"datum":"18.Jun","fromTime":"22h","title":"Illusion","description":"Bahaa Al Deen, Ryan Nasty, Anyzoba Techno \"Step into an enchanting realm where the ordinary gives way to the extraordinary at Illusion. (...) Let go of inhibitions as you immerse yourself in the pulsing energy that fills the air.\" Kinky, playful, extravagant, latex, leather, mesh, costumes - be creative and brave. No streetwear!"},{"datum":"19.Jun","fromTime":"22h","title":"Symbiotikka Goddesses Special","description":"A.n.i., Grace Thompson, Stuckeyrella, Eloisa, SaltySis, Noom1, Gea, Cara Elizabeth Trance, Techno After the overwhelming success of the Symbiotikka Goddesses Parties, the next edition. Let's celebrate the divine femininity, or female divinity together. 8 female DJs on 2 floors. Kinky Shows live, Bondage Show live, Playspace, Bodypainting, Pool and some special surprises... Be particular, creative, sexy, wicked, kinky, especially or crazy. But never boring!"},{"datum":"21.Jun","fromTime":"20h","title":"The Mystic Rose meets ATACAMA","description":"Opening heute schon um 20 Uhr (!), siehe unten unter „Special“, Decks ab 22 Uhr: Die Mantis (ab 20 Uhr), Jensson, Boom Shankar, Atacama, Chris A Nova, Mad Gorix, Kaspar Krug b2b Pabel Techno, Psytrance NEW: Every Friday &amp; Saturday the „Come Together“-Preparty @ 8 P.M.<br><br>Liebe Gäste &amp; Freunde der Nacht!<br>Seit letztem Samstag öffnen wir unsere Türen am Wochenende bereits um 20 Uhr und ab dieser Woche auch am Freitag! Von 20 bis 22 Uhr wollen wir leicht &amp; locker in den Abend einsteigen: Freunde treffen, chillen am Pool, Zeit zu plaudern und für ausführliche Gespräche. Eine Bar- und Strandatmosphäre schwebt uns vor: Ein „Come Together“ vor der Party!<br><br>Als angenehmen Nebeneffekt erhoffen wir, dass sich die ankommenden Gäste besser über die Nacht verteilen und sich dadurch die unsäglichen Wartezeiten in der Schlange elementar verkürzen. Oder im besten Fall erst gar keine Schlange entsteht. Wäre das nicht wunderbar?<br><br>Aus aktuellem Anlass möchten wir euch auch alle bitten, immer daran zu denken, dass es Nachbarn gibt, die Nachts ihre Ruhe wollen. Einige Beschwerden liegen vor, deshalb haben uns die zuständigen Ämter kontaktiert. Wir müssen außerhalb des Clubs definitiv leiser werden, bitte helft uns dabei! Knebel möchten wir ungern verteilen. :-)<br><br>Einen Dresscode gibt es für die Mystic Rose nicht, aber ab 20 Uhr ist der normale Obolus zu entrichten. Let`s dance &amp; play on!....Eure KitKat-Crew<br><br>Ab 20 Uhr legen an der Pool Bar auf: Die Mantis. 3 floors. Visuals &amp; Arts: Fun Plastica, Bodypainting, Hypnotikal Laser Productions. Spacebar by Ganesh, Massagen by Collin. No Dresscode... Just be yourself... But be sexy..."},{"datum":"22.Jun","fromTime":"19h","title":"Tango Rouge at CarneBall Bizarre","description":"19:00 Entrance Buffet. 19:30 Classes in Argentine Tango: No experience and no partner needed – come alone, as a couple or bring some friends! Warm up &amp; Beginners with Pedram Shahyar &amp; Thekla, Drama &amp; playful figures with Jonas Bieber &amp; Viktoria Sorochinski. 21:00 Milonga &amp; Party. Shows and performances through the night. Live music by Asaf Meller, piano, Doron Furman, oud, and Markus Teichert, vocals. Performances by Lucia Be &amp; Mathilde Domini and Viktoria Sorochinski &amp; Katarina Dmitrieva. Make-up Art by Ela, on donation. Entrance 19:00 - 21:00, strict dresscode! Classes start in time so please come early. The entry is valid for the whole Saturday night in all areas of KitKatClub. Playful, kinky, fetish, carnival, crazy, sexy, extremely elegant Tango. Casual dress = no entry!"},{"datum":"22.Jun","fromTime":"20h","title":"CarneBall Bizarre-KitKatClubnacht","description":"Opening heute wieder um 20 Uhr (!), siehe unten unter „Special“, Decks ab 22 Uhr: Elixier, Johann de Beers, Minja, Lisa de Lune und Felix FX. Disco Bizarre im 4. Raum, im Basement: Mr. Funghi, Studio Luce und Shimanski. Salon Rouge (ab 2 Uhr), im 5. Raum, im Basement: DJ Till Noon. Prisma Floor: Gavlak b2b Golden, The Shredder und Carl Conrad. NEW: Every Friday &amp; Saturday the „Come Together“-Preparty @ 8 P.M.<br>(Deutsche Fassung, siehe oben, Freitag)<br><br>Dear guests and night owls! <br>Starting last Saturday, we open our doors at 8 pm on weekends, now also on Fridays! Between 8 and 10 pm we want you to ease into the night: meet your friends for chatting or deeper conversations, all to the sound of chilled music at the pool. We envisage a bar and beach atmosphere – hence a “come together” before the party! <br><br>As a welcome side effect we hope this will spread out guest arrival over the course of the night and thereby hopefully reduce the terrible queuing times. Ideally we’d like to make queuing entirely unnecessary – now wouldn’t that be amazing?<br><br>Due to current issues we’d like to ask you to always consider our neighbours who do need their peace and quiet at night. We have been subject to several complaints, so we’re been watched by the authorities. Therefore, we definitely need to reduce noise levels outside the club, so please help us with this! We don’t want to solve this by gagging our guests. :-) <br><br>Of course, our dress code also applies from 8 pm and so does the usual entry fee. Let’s dance &amp; play on!….Your KitKat crew <br><br>Sauna, Outdoorarea, Playspace, Candy-Shop, etcetera .... :-) Kinky, Fetish, Gothik, Lack &amp; Leder, Kostüme, Glitzer &amp; Glamour, elegante Abendgarderobe, Außergewöhnliches jeder Art. Bunte Outfits werden bevorzugt! KEINE normale Straßenkleidung. Jeans &amp; Sportschuhe sind verboten! Normale Unterhosen auch. Wir sind kein Swingerclub. Anfassen, ohne das Einverständnis des Gegenübers, oder beim Vorübergehen, führt zu Hausverbot. Lebenslänglich."},{"datum":"23.Jun","fromTime":"08h","title":"Nachspiel-Afterhour: Carpe Diem!","description":"Coon, Kenny Techno, Electro \"The most famous Sunday Afterhour at KitKat Club. Sex-positive and queer-friendly Party Edition - kinky style! Hot or freaky, nerdy or beardy: everyone is welcome! Follow the rhythm of electronic music and be feel happy the way you are.\" Huge chill out areas, Swimming pool. Dress to impress! No street wear - no Jeans &amp; no T-Shirts."},{"datum":"23.Jun","fromTime":"22h","title":"Somnambul BLN","description":"Ante Perry, Bianka Banks, Extennisspieler Techno, Electro TheSundayNightElectronicDanceExperience@KitKatClub! \"On Sunday from 10 p.m., the Somnambul BLN celebrates, loves and dances without a strict dress code, but all the more freely. (...) Everything else is as usual at the KitKat: anything might happen - everything is possible - and nothing is obligatory.\" Outdoor pool area is open. No strict Dresscode … be yourself!"},{"description":""},{"datum":"24.Jun","fromTime":"22h","title":"Electric Monday","description":"Karina, Local Suicide, Ricardo Rodriguez, Frankie Flowerz Techno, House \"Enjoy the Vibe &amp; Get Freaky. Bring &amp; Share Love as Usual!\" Bodypainting Area, Freshfruits by the Fruit Fairy. We have a relaxed Dresscode so, Come As You Are, however it is still the KitKatClub, so do Dress n Express yourself - casual or colourful, fancy, different, smart - most of all be authentic."},{"datum":"25.Jun","fromTime":"22h","title":"Illusion","description":"Alec Hall, DJ Taste Techno \"Step into an enchanting realm where the ordinary gives way to the extraordinary at Illusion. (...) Let go of inhibitions as you immerse yourself in the pulsing energy that fills the air.\" Kinky, playful, extravagant, latex, leather, mesh, costumes - be creative and brave. No streetwear!"},{"datum":"26.Jun","fromTime":"22h","title":"Symbiotikka","description":"Jordan, Dennis Rema, Millie Forsberg, Unerhört Techno \"Expand your horizon and have a look over the edge. Celebrate with us Respect, Freedom, Love and Music!\" Kinky Shows live, Bondage Show live, Playspace, Bodypainting, Pool and some special surprises... Be particular, creative, sexy, wicked, kinky, especially or crazy. But never boring!"},{"datum":"27.Jun","fromTime":"20h","title":"Salon Rouge presents: The Shift//Angstblüten7//DJ Khan of Finland","description":"DJ Khan of Finland The Shift, Angstblüten7 We’re happy to invite you to a concert night at Salon Rouge (basement floor of KitKatClub) on Thursday 27.06.2024. Welcoming The Shift and Angstblüten7! And DJ Khan of Finland for the late hours dancing… Doors open at 8pm, Concerts from 9pm, tickets from 10€. Entrance through Ohmstraße 11. Follow the red signs &amp; lights and you may even keep your clothes on if you want (no mandatory dress code)."},{"datum":"27.Jun","fromTime":"22h","title":"Seven Sins","description":"Angioma, Slak Techno, Minimal Techno „Seven Sins isn't just a party—it's a movement celebrating a sex-positive and consent-focused culture. Our mission is to create an inclusive atmosphere where all are welcome to explore and express their desires freely and safely.“ Every 4th Thursday of the month at 22:00 in the KitKat basement. LEFT ENTRANCE! More informations and guest list:<br><br>https://de.ra.co/events/1933060"},{"datum":"28.Jun","fromTime":"20h","title":"PiepShow - JuniPridePiep","description":"Opening schon um 20 Uhr (!), siehe unten unter „Special“, Decks ab 22 Uhr, Mainfloor ebenfalls bereits ab 20 Uhr: David Strasser, Flextasy, Karim Alkhayat, Pakko, Chaos Techno.Berlin, Haennson, Louis Harshman, Unerhört, Ken, Fixie Fate. Separee: Loveman. Prisma: DJ Francis, Paderkid. Salon Rouge: DJ Khan of Finland, Soviet Gym, DJ Disaster Techno, Hard Techno, Hard Trance, House, Disco, Pop &amp; Mashup, 70s &amp; 80s NEW: Every Friday &amp; Saturday the „Come Together“-Preparty @ 8 P.M.<br><br>Dear guests and night owls!<br>Starting two weeks ago, we now open our doors at 8 pm on weekends, since last week also on Fridays! Between 8 and 10 pm we want you to ease into the night: meet your friends for chatting or deeper conversations, all to the sound of chilled music at the pool. We envisage a bar and beach atmosphere – hence a “come together” before the party!<br><br>As a welcome side effect we hope this will spread out guest arrival over the course of the night and thereby hopefully reduce the terrible queuing times. Ideally we’d like to make queuing entirely unnecessary – now wouldn’t that be amazing?<br><br>Due to current issues we’d like to ask you to always consider our neighbours who do need their peace and quiet at night. We have been subject to several complaints, so we’re been watched by the authorities. Therefore, we definitely need to reduce noise levels outside the club, so please help us with this! We don’t want to solve this by gagging our guests. :-)<br><br>Of course, our dress code also applies from 8 pm and so does the usual entry fee. Let’s dance &amp; play on!….Your KitKat crew<br><br>„PiepShow - YOUR party @KitKatClub every last Friday of the month. Berlin's happiest &amp; most colourful queer techno rave for everyone who loves to dance in tolerance.“ 6 dancefloors, basement area open! Many play-areas &amp; darkrooms throughout the entire club. Shibari-Show by Merlin, Drag Show by CoCo Kitsch and Raven van Krüger. Candy-Shop. Veggie buffet by Stefano. Shop/Accessoires by Lisa Majun. 14 hours of happy pieping: \"We can't wait to rave with YOU!\" &lt;3 Kinky or fetish (black or colourful), sporty (sportswear + sneakers), creative (sexy + imaginative), costumes. Regular jeans or T-shirts are usually no piep-outfits."},{"datum":"29.Jun","fromTime":"19h","title":"Tango Rouge at CarneBall Bizarre","description":"Special: 19:00 Entrance Buffet. 19:30 Classes in Argentine Tango: No experience and no partner needed – come alone, as a couple or bring some friends! Warm up &amp; Beginners with Sven Elze. Drama &amp; playful figures with Julian Elizari Romeo. 21:00 Milonga &amp; Party. Shows and performances through the night. Live music by Gustavo Garay, violin &amp; Gabriele Sabato, vocals. Entrance 19:00 - 21:00, strict dresscode! Classes start in time so please come early. The entry is valid for the whole Saturday night in all areas of KitKatClub. Playful, kinky, fetish, carnival, crazy, sexy, extremely elegant Tango. Casual dress = no entry!"},{"datum":"29.Jun","fromTime":"20h","title":"CarneBall Bizarre-KitKatClubnacht","description":"Opening heute wieder um 20 Uhr (!), siehe unten unter „Special“, Komfortrauschen (LIVE) ab 21 Uhr, Decks ab 23 Uhr: Wolle XDP, Shredder und Don Tom. Kellerkinder Special: Dexter, Avalok und MarcoA. Disco Bizarre im 4. Raum, im Basement: Aussteiger, Rune Cosmic, Martin Brodin, Robot Girl und D.J. himself. Salon Rouge (ab 2 Uhr), im 5. Raum, im Basement: Blue Alien performance (ab 2:00) und DJ Cameron. Prisma Floor: Skarafan b2b Heyleydavidson, Waves of Pleasure und Cheesebeat. NEW: Every Friday &amp; Saturday the „Come Together“-Preparty @ 8 P.M.<br>(English version see above, Friday)<br><br>Liebe Gäste &amp; Freunde der Nacht!<br>Seit vorletztem Samstag öffnen wir unsere Türen am Wochenende bereits um 20 Uhr und ab letzter Woche auch am Freitag! Von 20 bis 22 Uhr wollen wir leicht &amp; locker in den Abend einsteigen: Freunde treffen, chillen am Pool, Zeit zu plaudern und für ausführliche Gespräche. Eine Bar- und Strandatmosphäre schwebt uns vor: Ein „Come Together“ vor der Party!<br><br>Als angenehmen Nebeneffekt erhoffen wir, dass sich die ankommenden Gäste besser über die Nacht verteilen und sich dadurch die unsäglichen Wartezeiten in der Schlange elementar verkürzen. Oder im besten Fall erst gar keine Schlange entsteht. Wäre das nicht wunderbar?<br><br>Aus aktuellem Anlass möchten wir euch auch alle bitten, immer daran zu denken, dass es Nachbarn gibt, die Nachts ihre Ruhe wollen. Einige Beschwerden liegen vor, deshalb haben uns die zuständigen Ämter kontaktiert. Wir müssen außerhalb des Clubs definitiv leiser werden, bitte helft uns dabei! Knebel möchten wir ungern verteilen. :-)<br><br>Der Dresscode gilt selbstverständlich ab 20 Uhr, ebenso ist der normale Obolus zu entrichten. <br><br>Let`s dance &amp; play on!....Eure KitKat-Crew<br><br>Sauna, Outdoorarea, Playspace, Candy-Shop, etcetera .... :-) Kinky, Fetish, Gothik, Lack &amp; Leder, Kostüme, Glitzer &amp; Glamour, elegante Abendgarderobe, Außergewöhnliches jeder Art. Bunte Outfits werden bevorzugt! KEINE normale Straßenkleidung. Jeans &amp; Sportschuhe sind verboten! Normale Unterhosen auch. Wir sind kein Swingerclub. Anfassen, ohne das Einverständnis des Gegenübers, oder beim Vorübergehen, führt zu Hausverbot. Lebenslänglich."},{"datum":"30.Jun","fromTime":"08h","title":"Nachspiel-Afterhour: Carpe Diem!","description":"Kenny, Kevin Maan Techno, Electro \"The most famous Sunday Afterhour at KitKat Club. Sex-positive and queer-friendly Party Edition - kinky style! Hot or freaky, nerdy or beardy: everyone is welcome! Follow the rhythm of electronic music and be feel happy the way you are.\" Huge chill out areas, Swimming pool. Dress to impress! No street wear - no Jeans &amp; no T-Shirts."},{"datum":"30.Jun","fromTime":"22h","title":"Somnambul BLN","description":"Ariina, Manu Strasse, Snyl Techno, Electro TheSundayNightElectronicDanceExperience@KitKatClub! \"On Sunday from 10 p.m., the Somnambul BLN celebrates, loves and dances without a strict dress code, but all the more freely. (...) Everything else is as usual at the KitKat: anything might happen - everything is possible - and nothing is obligatory.\" Outdoor pool area is open. No strict Dresscode … be yourself!"},{"description":""},{"description":""},{"datum":"01.Jul","fromTime":"19h","title":"Tango Rouge","description":"(tba) 3 Tango classes (beginners, intermediate, advanced) from 7 pm. You don't need a partner for the classes - you can come alone, as a couple or in a group. Tango Party from 9 pm. Entry from 6:45 pm/Einlass ab 18 Uhr 45.<br><br>Our venue, Berlin's legendary KitKatClub, is a sex positive space where everyone can (doesn't have to) explore and express their sexuality without judgement and shame. Needless to say: Consent is always key. No dress code on Monday - but you are very welcome to dress to impress!"},{"datum":"01.Jul","fromTime":"22h","title":"Electric Monday meets Sanctuary Rome Showcase","description":"Three Less One, Sara Bluma, Frankie Flowerz, Ricardo Rodriguez Techno, House \"Enjoy the Vibe! Bring &amp; Share Love as Usual!\" LivePainting by Kaustav, Fresh Fruits by the Fruit Fairy. More informations and pre sale tickets:<br><br>https://de.ra.co/events/1939860 We have a relaxed Dresscode so, Come As You Are, however it is still the KitKatClub, so do Dress n Express yourself - casual or colourful, fancy, different, smart - most of all be authentic."},{"datum":"02.Jul","fromTime":"22h","title":"Grand Finale - Illusion","description":"Tmpr, Andrea Marino b2b Khira Li, Milla Lehto Techno \"Step into an enchanting realm where the ordinary gives way to the extraordinary at Illusion. (...) Let go of inhibitions as you immerse yourself in the pulsing energy that fills the air.\" Kinky, playful, extravagant, latex, leather, mesh, costumes - be creative and brave. No streetwear!"},{"datum":"03.Jul","fromTime":"22h","title":"Symbiotikka","description":"Mark Dekoda, Cara Elizabeth, Jordan, Daniel Neuland Techno \"Expand your horizon and have a look over the edge. Celebrate with us Respect, Freedom, Love and Music!\" Kinky Shows live, Bondage Show live, Playspace, Bodypainting, Pool and some special surprises... Be particular, creative, sexy, wicked, kinky, especially or crazy. But never boring!"},{"datum":"04.Jul","fromTime":"22h","title":"Human Colours – 2nd Anniversary of Burlesque Inferno","description":"Click Click, Pilea, Milk`N Coffee, Somaphon, Der Eggert, Rene Oldenburg, Marc Prochnow Trance, Techno „Hello all you lovely people, this month we have something very special to celebrate. Our colorful 2 year anniversary in our beloved KitKatClub. Let's celebrate together the colors of loving humanity in all its individual beauty and dance together to the hot, driving beat of summer.“ Starting tonight already from 21:30! Kinky Body Painting by Thaly White – LightgoesDark. Secret Burlesque Performance by Maria Mané. Attention, we are the original KitKat party this evening, LEFT ENTRANCE! There is another external event in the upper area of the club. Pre-sale tickets:<br><br>https://de.ra.co/events/1825580"},{"datum":"05.Jul","fromTime":"20h","title":"GEGEN Rush","description":"AaguilAA, Barbad, Black Lotus, Damien Barthet, Esther Dune, Henning Baer, Liza Aikin, Mauro Feola, Melanie Havens, Must B Me, Miro Von Berlin, Rangelova, Sanni Est, Stathis (GR), The Brvtalist, Znzl Techno, House NEW: Every Friday &amp; Saturday the „Come Together“-Preparty @ 8 P.M.<br>(Deutsche Fassung siehe unten, Samstag)<br><br>Dear guests and night owls! <br>Starting in June, we open our doors now at 8 pm on weekends, also on Fridays! Between 8 and 10 pm we want you to ease into the night: meet your friends for chatting or deeper conversations, all to the sound of chilled music at the pool. We envisage a bar and beach atmosphere – hence a “come together” before the party! <br><br>As a welcome side effect we hope this will spread out guest arrival over the course of the night and thereby hopefully reduce the terrible queuing times. Ideally we’d like to make queuing entirely unnecessary – now wouldn’t that be amazing?<br><br>Due to current issues we’d like to ask you to always consider our neighbours who do need their peace and quiet at night. We have been subject to several complaints, so we’re been watched by the authorities. Therefore, we definitely need to reduce noise levels outside the club, so please help us with this! We don’t want to solve this by gagging our guests. :-) <br><br>Of course, our dress code also applies from 8 pm and so does the usual entry fee. Let’s dance &amp; play on!….Your KitKat crew<br><br>„Beneath your pulsating heartbeat, amidst booming bass, you catch a familiar scent and it takes you right back to the blood-flowing womb. A chemical alkyl group turns the dance floor into a stage where these boundaries are tested, where the rush becomes a language spoken fluently by those seeking connection and release. (...)“ 5 Dancefloors. Performances by Blathin, Bleach, Jade Lee, Lucio Vidal, Pepe Maus, Po Nien. Fruit Buffet, Swimming Pool, Sidekicks/Sonar Harm Reduction Stand. Full concept, more informations and different pre-sale tickets:<br><br>https://de.ra.co/events/1923173 Red &amp; yellow, alluring, overstimulating, vibrant, dazzling, hypnotic, euphoric, overloaded, flashy, liquid gold, rushed, athletic, lycra, fetish, latex, leather, or just simply naked. No casual wear."},{"datum":"06.Jul","fromTime":"20h","title":"CarneBall Bizarre-KitKatClubnacht","description":"Opening heute wieder um 20 Uhr (!), siehe unten unter „Special“, Decks ab 22 Uhr: (tba). Ebenfalls bereits ab 20 Uhr separate Veranstaltung im Basement: Stolz und Demut. Ab ca. 1 Uhr: Disco Bizarre im 4. Raum, im Basement: Son Of Lee, Glitzer Blitzer und Billy Idle. Salon Rouge (ab ca. 2 Uhr), im 5. Raum, im Basement. Prisma Floor: Andeel, Rochelle Baz und The Shredder. NEW: Every Friday &amp; Saturday the „Come Together“-Preparty @ 8 P.M.<br>(English version see above, Friday)<br><br>Liebe Gäste &amp; Freunde der Nacht!<br>Seit Mitte Juni öffnen wir unsere Türen am Wochenende bereits um 20 Uhr und seit zwei Wochen auch am Freitag! Von 20 bis 22 Uhr wollen wir leicht &amp; locker in den Abend einsteigen: Freunde treffen, chillen am Pool, Zeit zu plaudern und für ausführliche Gespräche. Eine Bar- und Strandatmosphäre schwebt uns vor: Ein „Come Together“ vor der Party!<br><br>Als angenehmen Nebeneffekt erhoffen wir, dass sich die ankommenden Gäste besser über die Nacht verteilen und sich dadurch die unsäglichen Wartezeiten in der Schlange elementar verkürzen. Oder im besten Fall erst gar keine Schlange entsteht. Wäre das nicht wunderbar?<br><br>Aus aktuellem Anlass möchten wir euch auch alle bitten, immer daran zu denken, dass es Nachbarn gibt, die Nachts ihre Ruhe wollen. Einige Beschwerden liegen vor, deshalb haben uns die zuständigen Ämter kontaktiert. Wir müssen außerhalb des Clubs definitiv leiser werden, bitte helft uns dabei! Knebel möchten wir ungern verteilen. :-)<br><br>Der Dresscode gilt selbstverständlich ab 20 Uhr, ebenso ist der normale Obolus zu entrichten. <br><br>Let`s dance &amp; play on!....Eure KitKat-Crew<br><br>Sauna, Outdoorarea, Playspace, Candy-Shop, etcetera .... :-) Kinky, Fetish, Gothik, Lack &amp; Leder, Kostüme, Glitzer &amp; Glamour, elegante Abendgarderobe, Außergewöhnliches jeder Art. Bunte Outfits werden bevorzugt! KEINE normale Straßenkleidung. Jeans &amp; Sportschuhe sind verboten! Normale Unterhosen auch. Wir sind kein Swingerclub. Anfassen, ohne das Einverständnis des Gegenübers, oder beim Vorübergehen, führt zu Hausverbot. Lebenslänglich."},{"datum":"07.Jul","fromTime":"08h","title":"Nachspiel-Afterhour: Carpe Diem!","description":"Match Hoffman, Chris Veron, Daora Techno, Electro \"The most famous Sunday Afterhour at KitKatClub. Sex-positive and queer-friendly Party Edition - kinky style! Hot or freaky, nerdy or beardy: everyone is welcome! Follow the rhythm of electronic music and be feel happy the way you are.\" Huge chill out areas, Swimming pool. Dress to impress! No street wear - no Jeans &amp; no T-Shirts."},{"datum":"07.Jul","fromTime":"22h","title":"Somnambul BLN","description":"Arni b2b Maze Kashi, Mylndr, Rad.Lez Techno, Electro TheSundayNightElectronicDanceExperience@KitKatClub! \"On Sunday from 10 p.m., the Somnambul BLN celebrates, loves and dances without a strict dress code, but all the more freely. (...) Everything else is as usual at the KitKat: anything might happen - everything is possible - and nothing is obligatory.\" Outdoor pool area is open. No strict Dresscode … be yourself!"},{"description":""},{"datum":"08.Jul","fromTime":"19h","title":"Tango Rouge","description":"(tba) 3 Tango classes (beginners, intermediate, advanced) from 7 pm. You don't need a partner for the classes - you can come alone, as a couple or in a group. Tango Party from 9 pm. Entry from 6:45 pm/Einlass ab 18 Uhr 45.<br><br>Our venue, Berlin's legendary KitKatClub, is a sex positive space where everyone can (doesn't have to) explore and express their sexuality without judgement and shame. Needless to say: Consent is always key. No dress code on Monday - but you are very welcome to dress to impress!"},{"datum":"08.Jul","fromTime":"22h","title":"Electric Monday","description":"Brizman (formerly known as Gel Abril), Can Djane, Berkita, Ricardo Rodriguez, Frankie Flowerz Techno, House \"Enjoy the Vibe! Bring &amp; Share Love as Usual!\" Bodypainting Area, Fresh Fruits by The Fruit Fairy. More informations and pre sale tickets:<br><br>https://de.ra.co/events/1939887 We have a relaxed Dresscode so, Come As You Are, however it is still the KitKatClub, so do Dress n Express yourself - casual or colourful, fancy, different, smart - most of all be authentic."},{"datum":"10.Jul","fromTime":"22h","title":"Symbiotikka","description":"DJ Emerson, Jordan, Grace Thompson, Epicx Techno \"Expand your horizon and have a look over the edge. Celebrate with us Respect, Freedom, Love and Music!\" Kinky Shows live, Bondage Show live, Playspace, Bodypainting, Pool and some special surprises... Be particular, creative, sexy, wicked, kinky, especially or crazy. But never boring!"},{"datum":"11.Jul","fromTime":"22h","title":"Psycho Wet","description":"Der Freak, Ari, Epicx, Johnson Patrick \"Where Psy meets Techno. In the basement of KitKatClub.“ Performance, Play Area, Photos. Welcomes: LGBTQ, Body positivity, Inked. Bikini, kinky, extravagant, gothic, goa. No casual!"},{"datum":"12.Jul","fromTime":"20h","title":"Revolver Party","description":"Opening heute wieder um 20 Uhr (!), siehe unten unter „Special“, Decks ab 22 Uhr: Yannick Weineck, Federico Maniscalco, Daniel Boon, Marcel db, Darren Black, Jaycap, Rubi NEW: Every Friday &amp; Saturday the „Come Together“-Preparty @ 8 P.M.<br><br>Liebe Gäste &amp; Freunde der Nacht!<br>Seit Mitte Juni öffnen wir unsere Türen am Wochenende bereits um 20 Uhr und seit drei Wochen auch am Freitag! Von 20 bis 22 Uhr wollen wir leicht &amp; locker in den Abend einsteigen: Freunde treffen, chillen am Pool, Zeit zu plaudern und für ausführliche Gespräche. Eine Bar- und Strandatmosphäre schwebt uns vor: Ein „Come Together“ vor der Party!<br><br>Als angenehmen Nebeneffekt erhoffen wir, dass sich die ankommenden Gäste besser über die Nacht verteilen und sich dadurch die unsäglichen Wartezeiten in der Schlange elementar verkürzen. Oder im besten Fall erst gar keine Schlange entsteht. Wäre das nicht wunderbar?<br><br>Aus aktuellem Anlass möchten wir euch auch alle bitten, immer daran zu denken, dass es Nachbarn gibt, die Nachts ihre Ruhe wollen. Einige Beschwerden liegen vor, deshalb haben uns die zuständigen Ämter kontaktiert. Wir müssen außerhalb des Clubs definitiv leiser werden, bitte helft uns dabei! Knebel möchten wir ungern verteilen. :-)<br><br>Der Dresscode gilt selbstverständlich ab 20 Uhr, ebenso ist der normale Obolus zu entrichten. <br><br>Let`s dance &amp; play on!....Eure KitKat-Crew<br><br>Revolver is the monthly gay party event in KitKatClub. “Our events are safe spaces for queer and trans men and are THEREFORE strictly men only!“ Buy your tickets: <br><br>https://revolverparty.com/tickets Fetish clothing, jockstraps, mesh shirts, sporty outfits. The more creative, the better!"},{"datum":"13.Jul","fromTime":"19h","title":"Tango Rouge at CarneBall Bizarre","description":"19:00 Entrance Buffet. 19:30 Classes in Argentine Tango: No experience and no partner needed – come alone, as a couple or bring some friends! 2 Classes, Beginners Class: Introduction to Tango. Dramatic &amp; playful figures. 21:00 Tango Party in Salon Rouge. Live music and Performances all night long. Entry from 19:00/Einlass ab 19:00 Uhr, you need to be there before 21:00. The entry is valid for the whole Saturday night in all areas of KitKatClub. Playful, kinky, fetish, carnival, crazy, sexy, extremely elegant Tango. Casual dress = no entry!"},{"datum":"13.Jul","fromTime":"20h","title":"CarneBall Bizarre-KitKatClubnacht","description":"Opening heute wieder um 20 Uhr (!), siehe unten unter „Special“, Decks ab 22 Uhr: (tba). Disco Bizarre im 4. Raum, im Basement: Badknife, Discolypso crew, (tba) und D.J. himself. Salon Rouge (ab 2 Uhr), im 5. Raum, im Basement: Slow Grind Bizarre mit Don Rogall (turntables)*. Prisma Floor: (tba). NEW: Every Friday &amp; Saturday the „Come Together“-Preparty @ 8 P.M.<br>(Deutsche Fassung siehe oben, Freitag)<br><br>Dear guests and night owls! <br>Starting in June, we open our doors now at 8 pm on weekends, also on Fridays! Between 8 and 10 pm we want you to ease into the night: meet your friends for chatting or deeper conversations, all to the sound of chilled music at the pool. We envisage a bar and beach atmosphere – hence a “come together” before the party! <br><br>As a welcome side effect we hope this will spread out guest arrival over the course of the night and thereby hopefully reduce the terrible queuing times. Ideally we’d like to make queuing entirely unnecessary – now wouldn’t that be amazing?<br><br>Due to current issues we’d like to ask you to always consider our neighbours who do need their peace and quiet at night. We have been subject to several complaints, so we’re been watched by the authorities. Therefore, we definitely need to reduce noise levels outside the club, so please help us with this! We don’t want to solve this by gagging our guests. :-) <br><br>Of course, our dress code also applies from 8 pm and so does the usual entry fee. Let’s dance &amp; play on!….Your KitKat crew<br><br>Sauna, Outdoorarea, Playspace, Candy-Shop, etcetera .... :-) Kinky, Fetish, Gothik, Lack &amp; Leder, Kostüme, Glitzer &amp; Glamour, elegante Abendgarderobe, Außergewöhnliches jeder Art. Bunte Outfits werden bevorzugt! KEINE normale Straßenkleidung. Jeans &amp; Sportschuhe sind verboten! Normale Unterhosen auch. Wir sind kein Swingerclub. Anfassen, ohne das Einverständnis des Gegenübers, oder beim Vorübergehen, führt zu Hausverbot. Lebenslänglich."},{"datum":"14.Jul","fromTime":"08h","title":"Nachspiel-Afterhour: Carpe Diem!","description":"Marcel db, Sascha Lindner, Glabmas&amp;Glabsem Techno, Electro \"The most famous Sunday Afterhour at KitKat Club. Sex-positive and queer-friendly Party Edition - kinky style! Hot or freaky, nerdy or beardy: everyone is welcome! Follow the rhythm of electronic music and be feel happy the way you are.\" Huge chill out areas, Swimming pool. Dress to impress! No street wear - no Jeans &amp; no T-Shirts."},{"datum":"14.Jul","fromTime":"22h","title":"Somnambul BLN","description":"Nick Grater, Ryan Hill, Tank Girl Techno, Electro TheSundayNightElectronicDanceExperience@KitKatClub! \"On Sunday from 10 p.m., the Somnambul BLN celebrates, loves and dances without a strict dress code, but all the more freely. (...) Everything else is as usual at the KitKat: anything might happen - everything is possible - and nothing is obligatory.\" Outdoor pool area is open. No strict Dresscode … be yourself!"},{"description":""},{"datum":"15.Jul","fromTime":"19h","title":"Tango Rouge","description":"(tba) 3 Tango classes (beginners, intermediate, advanced) from 7 pm. You don't need a partner for the classes - you can come alone, as a couple or in a group. Tango Party from 9 pm. Entry from 6:45 pm/Einlass ab 18 Uhr 45.<br><br>Our venue, Berlin's legendary KitKatClub, is a sex positive space where everyone can (doesn't have to) explore and express their sexuality without judgement and shame. Needless to say: Consent is always key. No dress code on Monday - but you are very welcome to dress to impress!"},{"datum":"15.Jul","fromTime":"22h","title":"Electric Monday","description":"Harris, Bert, Psycho Jones, Frankie Flowerz, Ricardo Rodriguez Techno, House \"Enjoy the Vibe! Bring &amp; Share Love as Usual!\" More informations and pre sale tickets:<br><br>https://de.ra.co/events/1939893 We have a relaxed Dresscode so, Come As You Are, however it is still the KitKatClub, so do Dress n Express yourself - casual or colourful, fancy, different, smart etc. - most of all be authentic."},{"datum":"17.Jul","fromTime":"22h","title":"Symbiotikka","description":"StoKed, Jordan, Sikhaya, Dennis Rema Techno \"Expand your horizon and have a look over the edge. Celebrate with us Respect, Freedom, Love and Music!\" Kinky Shows live, Bondage Show live, Playspace, Bodypainting, Pool and some special surprises... Be particular, creative, sexy, wicked, kinky, especially or crazy. But never boring!"}]